<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<!-- saved from url=(0058)http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html -->
<HTML><HEAD><TITLE>Dejiny informatiky - Po&#269;íta&#269;ová revolúcia</TITLE>
<META http-equiv=content-type content="text/html; charset=ISO-8859-1"><LINK 
media=screen 
href="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/dejiny_inf.css" 
type=text/css rel=StyleSheet><LINK media=print 
href="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/dejiny_inf_print.css" 
type=text/css rel=StyleSheet>
<META content="MSHTML 6.00.2900.6036" name=GENERATOR></HEAD>
<BODY>
<TABLE 
style="MARGIN-LEFT: auto; WIDTH: 600px; MARGIN-RIGHT: auto; TEXT-ALIGN: left" 
cellSpacing=0 cellPadding=0 border=0>
  <TBODY>
  <TR>
    <TD><A name=start></A><SMALL style="COLOR: rgb(128,128,128)">Tento 
      dokument&nbsp;obsahuje mierne pozmenené prvé tri kapitoly z &#269;lánku <SPAN 
      style="FONT-WEIGHT: bold">Po&#269;íta&#269;ová revolúcia, zborník 
      SOFSEM'82</SPAN>.&nbsp;V &#269;lánku boli opravené niektoré chyby (mená, roky, 
      názvy) a zmenené obrázky.</SMALL><BR><BR>
      <H1 style="TEXT-ALIGN: center">PO&#268;ÍTA&#268;OVÁ REVOLÚCIA</H1><BR><BR>
      <DIV style="TEXT-ALIGN: center">J.&nbsp;Gruska&nbsp;<A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#vss">*</A>, 
      I.&nbsp;M.&nbsp;Havel&nbsp;<A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#meta">**</A>, 
      <A href="http://www.uivt.cas.cz/~wieder/" 
      target=_blank>J.&nbsp;Wiedermann</A>&nbsp;<A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#vss">*</A>, 
      J.&nbsp;Zelený&nbsp;<A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#vums">***</A></DIV><BR><BR>
      <TABLE class=menu_table cellSpacing=0 cellPadding=2 border=1>
        <TBODY>
        <TR>
          <TD>1</TD>
          <TD><A 
            href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#1">Úvod</A></TD></TR>
        <TR>
          <TD>2</TD>
          <TD><A 
            href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#2">Ako 
            to všetko vzniklo</A></TD></TR>
        <TR>
          <TD>2.1</TD>
          <TD><A 
            href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#2_1">Pamätanie 
            informácie</A></TD></TR>
        <TR>
          <TD>2.2</TD>
          <TD><A 
            href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#2_2">Prenos 
            informácie</A></TD></TR>
        <TR>
          <TD>2.3</TD>
          <TD><A 
            href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#2_3">Spracovanie 
            informácie</A></TD></TR>
        <TR>
          <TD>2.4</TD>
          <TD><A 
            href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#2_4">Vznik 
            informatiky</A></TD></TR>
        <TR>
          <TD>3</TD>
          <TD><A 
            href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#3">Výpo&#269;tová 
            technika na prahu po&#269;íta&#269;ovej revolúcie</A></TD></TR>
        <TR>
          <TD>3.1</TD>
          <TD><A 
            href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#3_1">Polovodi&#269;e 
            – základ po&#269;íta&#269;ového blahobytu</A></TD></TR></TBODY></TABLE><BR>
      <H2><A name=1></A>1 ÚVOD</H2><BR>
      <DIV style="FONT-STYLE: italic; TEXT-ALIGN: right">Všetci sa musíme stara&#357; 
      o&nbsp;budúcnos&#357;,<BR>pretože v&nbsp;nej strávime zvyšok svojho 
      života.<BR><A href="http://en.wikipedia.org/wiki/Charles_Kettering" 
      target=_blank>Ch. F. Kettering</A></DIV><BR><BR>
      <P>Budeme písa&#357; o&nbsp;revolúcii, ktorá ešte nenastala. Revolúcie 
      spravidla prichádzajú ne&#269;akane – naša revolúcia je o&#269;akávaná. Jej 
      predzves&#357;ou je rozširovanie osobných po&#269;íta&#269;ov, vytváranie obrovských 
      po&#269;íta&#269;ových sietí, videotexových systémov, komputerizácia všemožných 
      odvetví správy, priemyslu, služieb, výchovy, vo&#318;ného &#269;asu at&#271;.</P>
      <P>Po&#269;íta&#269;ovou revolúciou mienime proces premeny spolo&#269;nosti, &#318;udských 
      vz&#357;ahov, životného štýlu a&nbsp;intelektuálnej klímy doby. Teda proces, 
      ktorý je uvedený do pohybu prítomnos&#357;ou systémov na pamätanie, spracovanie 
      a&nbsp;prenos informácie, v&nbsp;ktorých po&#269;íta&#269;e hrajú k&#318;ú&#269;ovú úlohu. 
      Po&#269;íta&#269;ovú revolúciu teda nechápeme ako revolúciu v&nbsp;technológii 
      pamätania, spracovania a&nbsp;prenosu informácie, zaprí&#269;inenú revolúciou 
      v&nbsp;polovodi&#269;ovej technológii. Táto revolúcia v&nbsp;technológii 
      podmie&#328;uje po&#269;íta&#269;ovú revolúciu najmä tým, že prináša výrazné zvä&#269;šenie 
      výkonu, miniaturizáciu, pokles cien at&#271;.</P>
      <P>Technológiu chápeme pritom širšie – ako súhrn poznatkov, metód 
      a&nbsp;technických prostriedkov. Do technológie po&#269;ítame teda aj 
      matematické poznatky, algoritmy, programy v&nbsp;umelej inteligencii, 
      softwarové systémy at&#271;.</P>
      <P>K technologickým zmenám, ktoré bezpochyby výrazne ovplyvnili vývoj 
      &#318;udskej spolo&#269;nosti, patrí používanie oh&#328;a, vznik re&#269;i, písma, kníhtla&#269;e 
      at&#271;.</P>
      <P>Používaním oh&#328;a za&#269;ala éra energotechnológie, v&nbsp;ktorej &#269;lovek, zo 
      za&#269;iatku pomocou oh&#328;a, za&#269;al umoc&#328;ova&#357; výkonnos&#357; svojich svalov 
      a&nbsp;zmyslov a&nbsp;za&#269;al pretvára&#357; neživú hmotu zemskej kôry 
      a&nbsp;vytvára&#357; si nové prostredie a&nbsp;nové prostriedky, ktoré mu 
      spríjem&#328;ujú a&nbsp;u&#318;ah&#269;ujú život. Vznik parného stroja, výbušného 
      a&nbsp;elektrického motora mal za následok nevídaný kvalitatívny skok 
      v&nbsp;tomto procese, ktorý dnes vtesnávame pod názov priemyselná 
      revolúcia.</P>
      <P>Plnšie pochopenie významného obdobia vo vývoji spolo&#269;nosti nastáva 
      obvykle až ke&#271; toto obdobie kon&#269;í a&nbsp;za&#269;ína kvalitatívne nové. Zdá sa, 
      že sa práve nachádzame v&nbsp;takej situácii. Priemyselná revolúcia 
      prerastá v&nbsp;po&#269;íta&#269;ovú revolúciu, ktorou vrcholí éra energotechnológie 
      a&nbsp;sú&#269;asne asi za&#269;ína éra biotechnológie, v&nbsp;ktorej o&#269;akávame, že 
      &#269;lovek, pomocou molekulárnej elektroniky, bude umoc&#328;ova&#357; výkonnos&#357; svojho 
      mozgu, zmyslov a&nbsp;svalov a&nbsp;bude pretvára&#357; živú hmotu zemského 
      povrchu a&nbsp;vytvára&#357; si nové, živé aj neživé prostredie 
      a&nbsp;prostriedky, ktoré mu budú spríjem&#328;ova&#357; a&nbsp;u&#318;ah&#269;ova&#357; život.</P>
      <P>Na priemyselnú revolúciu sa môžeme díva&#357; ako na revolúciu, ktorá 
      vznikla emancipáciou a&nbsp;exponenciálnym umocnením fyzickej sily 
      &#318;udských svalov. Priemyselná revolúcia nielen priniesla podstatné zmeny 
      v&nbsp;organizácii spolo&#269;nosti a&nbsp;živote jednotlivca, ale zmenila aj 
      názory na svet. Hmota sa stala základnou kategóriou a&nbsp;svet sa za&#269;al 
      chápa&#357; ako "hmota v&nbsp;pohybe".</P>
      <P>Na druhej strane, na za&#269;ínajúcu po&#269;íta&#269;ovú revolúciu sa môžeme díva&#357; 
      ako na revolúciu, ktorá vznikne emancipáciou a&nbsp;exponenciálnym 
      umocnením intelektuálnej sily &#318;udského mozgu. Už táto zjednodušená 
      charakteristika nazna&#269;uje, že po&#269;íta&#269;ová revolúcia by mala ma&#357; podstatne 
      vä&#269;ší vplyv na život spolo&#269;nosti a&nbsp;jednotlivca a&nbsp;názory na svet, 
      v&nbsp;ktorých asi informácia bude ma&#357; k&#318;ú&#269;ová úlohu a&nbsp;svet sa bude 
      chápa&#357; ako "informácia v&nbsp;&#269;innosti".</P>
      <P>Istú predstavu o&nbsp;možnom priebehu a&nbsp;dôsledkoch po&#269;íta&#269;ovej 
      revolúcie získame, ak si uvedomíme hlavné &#269;rty vzniku, priebehu 
      a&nbsp;dôsledkov priemyselnej revolúcie:</P>
      <UL>
        <LI>Revolúcii predchádzala predrevolu&#269;ná fáza (hromadenie vynálezov 
        a&nbsp;pod.), v&nbsp;ktorej sa navonok ni&#269; nedialo. 
        <LI>Nástup vlastnej revolúcie si jej sú&#269;asníci neuvedomovali. Revolúcia 
        trvala asi 100 rokov, prebiehala stále rýchlejšie a&nbsp;priniesla 
        obrovské zmeny v celom živote spolo&#269;nosti: ovplyvnila život jednotlivca, 
        rodiny, inštitúcií, ekonomiku, politiku, ideológiu, výchovu, vzdelanie, 
        využívanie vo&#318;ného &#269;asu, stravu, odev a&nbsp;dokonca aj spôsoby pôrodu 
        a&nbsp;pochovávania. 
        <LI>Nikto, ani filozofia, ani politici, ani vedci, ani technici si na 
        za&#269;iatku revolúcie nedokázali predstavi&#357;, v&nbsp;akom smere, ako rýchle 
        a&nbsp;s&nbsp;akým dopadom sa bude revolúcia vyvíja&#357;. Revolu&#269;ný proces 
        bolo &#357;ažké podstatne ovplyv&#328;ova&#357;. Pokusy o&nbsp;jeho zoslabenie, resp. 
        usmernenie skôr do oblasti, kde by priniesol permanentnejší úžitok pre 
        &#318;udstvo, ako do oblasti prinášajúcich okamžitý zisk, boli len lokálne 
        úspešné. 
        <LI>Po revolúcii nasledovala porevolu&#269;ná fáza, v&nbsp;ktorej je 
        spolo&#269;nos&#357; opä&#357; ustálená – ale celkom iná ako predtým. </LI></UL>
      <P>(Je povšimnutia hodné, že skupina expertov britskej vlády odhadovala 
      v&nbsp;r.&nbsp;1948, že Ve&#318;ká Británia bude celkove potrebova&#357; asi 5 
      po&#269;íta&#269;ov (typu ENIAC)).</P>
      <P>Priemyselná revolúcia však priniesla &#318;udstvu aj jasné poznanie, že 
      zmeny v&nbsp;technológii môžu ma&#357; obrovské dôsledky. Na rozdiel od 
      priemyselnej revolúcie za&#269;ína po&#269;íta&#269;ová revolúcia v&nbsp;období, ke&#271; sa 
      spolo&#269;nos&#357; snaží cie&#318;avedome a&nbsp;systematicky revolúciu zaprí&#269;inenú 
      zmenou v&nbsp;polovodi&#269;ovej technológii ovláda&#357; a&nbsp;usmer&#328;ova&#357; tak, aby 
      sa umoc&#328;oval pozitívny dopad revolúcie a&nbsp;minimalizoval dopad 
      negatívny. K tomu je však nutné dôkladne analyzova&#357; vznik revolúcie, 
      sú&#269;asný stav a&nbsp;o&#269;akávaný vývoj príslušnej technológie 
      a&nbsp;o&#269;akávaná zmeny v&nbsp;živote spolo&#269;nosti. O&nbsp;to sa, aspo&#328; 
      &#269;iasto&#269;ne, pokúsime v&nbsp;tomto &#269;lánku.</P>
      <P>Dôležité si je tiež uvedomi&#357;, že v&nbsp;dnešnej dobe sa tak rýchle mení 
      svet, hodnoty, ciele, že pre správne rozhodovanie sa v&nbsp;prítomnosti je 
      &#269;asto ove&#318;a dôležitejšie ma&#357; dobrú predstavu o&nbsp;budúcnosti, ako 
      perfektnú znalos&#357; minulosti.</P>
      <P>Na po&#269;íta&#269;e sa už dnes musíme díva&#357; ove&#318;a komplexnejšie, ako na ve&#318;mi 
      výkonné a&nbsp;(v&nbsp;budúcnosti) inteligentné systémy na uchovávanie, 
      spracovanie a&nbsp;prenos informácie. Až takto komplexne chápané 
      a&nbsp;používané po&#269;íta&#269;e sú v&nbsp;podstate základom vzniku po&#269;íta&#269;ovej 
      revolúcie. Z&nbsp;tohto h&#318;adiska, ktoré je v&nbsp;zna&#269;nej miere pôvodné, 
      sa pozrieme v&nbsp;&#271;alšom na vznik, technologické predpoklady a&nbsp;dopad 
      po&#269;íta&#269;ovej revolúcie.</P>
      <P>&#268;lánok sa skladá (okrem tohto úvodu) zo štyroch kapitol, ktoré sú 
      vlastne štyri samostatné eseje na spolo&#269;nú tému po&#269;íta&#269;ovej revolúcie. 
      Prirodzene, že nevy&#269;erpávajú celú problematiku, sú do istej miery 
      subjektívne a&nbsp;reprezentujú len názory autorov príslušnej eseje.</P>
      <UL>
        <LI><SPAN style="FONT-WEIGHT: bold"><A 
        href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#2">Ako 
        to všetko vzniklo</A> (kap.&nbsp;2)</SPAN> – 
        pokus&nbsp;o&nbsp;historický poh&#318;ad na technologické a&nbsp;ideové 
        zdroje oboru do vzniku von Neumannovho po&#269;íta&#269;a. Pritom nejde tak 
        o&nbsp;históriu, ako skôr o&nbsp;odpove&#271; na otázku: aké boli predpoklady 
        a&nbsp;prí&#269;iny vzniku nových objavov, vynálezov a&nbsp;ideí, ktoré 
        viedli&nbsp;k&nbsp;príchodu moderných po&#269;íta&#269;ov a&nbsp;akí boli &#318;udia, 
        ktorí za nimi stáli. 
        <LI><SPAN style="FONT-WEIGHT: bold"><A 
        href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#3">Výpo&#269;tová 
        technika na prahu po&#269;íta&#269;ovej revolúcie</A> 
        (kap.&nbsp;3)</SPAN>&nbsp;–&nbsp;preh&#318;ad&nbsp;o&nbsp;funkciách 
        a&nbsp;schopnostiach dnešných po&#269;íta&#269;ov s&nbsp;výh&#318;adom na nieko&#318;ko 
        najbližších rokov. Vychádza sa pritom z dosiahnutej úrovne technológie 
        polovodi&#269;ových sú&#269;iastok. 
        <LI><SPAN style="FONT-WEIGHT: bold">Mlyny na rozum (kap.&nbsp;4)</SPAN> 
        – hlavné ideové smery umelej inteligencie (aj s&nbsp;trochou 
        predhistórie a&nbsp;s kritickými hlasmi) s&nbsp;dôrazom na to, &#269;o môže 
        ovplyvni&#357; charakter po&#269;íta&#269;ovej revolúcie. 
        <LI><SPAN style="FONT-WEIGHT: bold">Ako to všetko dopadne 
        (kap.&nbsp;5)</SPAN> – futurológia porevolu&#269;nej fázy. &#268;o všetko sa dá i 
        nedá o&#269;akáva&#357; – pozitívne i negatívne dôsledky. Tiež nové videnie sveta. 
        Poznámka o&nbsp;morálnej zodpovednosti a&nbsp;tiež trocha sci-fi. 
      </LI></UL>
      <DIV style="TEXT-ALIGN: right"><A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#start">spa&#357; 
      na obsah</A></DIV>
      <H2><A name=2></A>2 AKO TO VŠETKO VZNIKLO</H2><BR>
      <DIV style="TEXT-ALIGN: right"><SPAN style="FONT-STYLE: italic">The past 
      is but the beginning of a&nbsp;beginning,<BR>and all that is and has been 
      is but the twilight of the dawn.</SPAN><BR style="FONT-STYLE: italic"><A 
      href="http://en.wikipedia.org/wiki/H._G._Wells" target=_blank><SPAN 
      style="FONT-STYLE: italic">H. G. Wells</SPAN></A><BR></DIV><BR>
      <P>Moderná biológia sa za&#269;ína díva&#357; na živé organizmy ako na systémy pre 
      príjem, pamätanie a&nbsp;spracovanie informácie. Vznik re&#269;i a&nbsp;súbežný 
      vznik myslenia vytvorili z&nbsp;prvotného &#269;loveka najdokonalejší živý 
      systém pre pamätanie, spracovanie a&nbsp;prenos informácie. Z&nbsp;&#269;loveka 
      sa stal vládca prírody.</P>
      <P>Pre &#318;udstvo je prízna&#269;né, že od pradávna sa snažilo tieto schopnosti 
      &#269;loveka umoc&#328;ova&#357;. Od pradávna sa rozvíjali technológie pamätania, prenosu 
      a&nbsp;spracovania informácie a&nbsp;so vznikom modernej vedy za&#269;ala sa 
      rozvíja&#357; aj teória.</P>
      <P>Postupný vývoj po&#269;íta&#269;ov zo systémov na spracovanie informácie cez 
      systémy na pamätanie a&nbsp;spracovanie informácie až k systémom na 
      pamätanie, spracovanie a&nbsp;prenos informácie, ktoré budú vybavené 
      "inteligentným softwarom", dáva vznik kvalitatívne novým systémom, ktoré 
      sú základom po&#269;íta&#269;ovej revolúcie.</P>
      <P>V tejto kapitole sa sústredíme na niektoré významné udalosti, objavy 
      a&nbsp;idey v&nbsp;technológiách pamätania, prenosu a&nbsp;spracovania 
      informácie a&nbsp;na vznik príslušnej teórie. Pokúsime sa zodpoveda&#357; 
      otázky: pre&#269;o sa to stalo, kto to urobil, aké to malo dôsledky. Obmedzíme 
      sa pritom na obdobie približne do roku 1950 – do vzniku von Neumannovho 
      a&nbsp;von Neumannovského po&#269;íta&#269;a.</P>
      <DIV style="TEXT-ALIGN: right"><A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#start">spa&#357; 
      na obsah</A></DIV>
      <H3><A name=2_1></A>2.1 PAMÄTANIE INFORMÁCIE</H3>
      <P>Vznik písma ako spôsobu formalizácie re&#269;i bol prvým ve&#318;kým skokom 
      v&nbsp;oblasti pamätania a&nbsp;prenosu informácie a&nbsp;za&#269;iatkom 
      historickej doby &#318;udstva.</P>
      <P>O &#269;es&#357; tohto najgeniálnejšieho objavu v&nbsp;dejinách &#318;udstva sú&#357;ažia 
      v&nbsp;dnešnej dobe tri staroveké civilizácie: <A 
      href="http://en.wikipedia.org/wiki/Mesopotamia" 
      target=_blank>mezopotámska</A>, <A 
      href="http://en.wikipedia.org/wiki/Ancient_Egypt" 
      target=_blank>egyptská</A> a&nbsp;civilizácia <A 
      href="http://en.wikipedia.org/wiki/Harappa" target=_blank>Harappy</A> 
      a&nbsp;<A href="http://en.wikipedia.org/wiki/Mohenjo-daro" 
      target=_blank>MohendžaDára</A> (na území dnešného <A 
      href="http://en.wikipedia.org/wiki/PAKISTAN" target=_blank>Pakistanu</A>). 
      Archeologické objavy nazna&#269;ujú pomerne rozvinuté používanie písma už 
      v&nbsp;4. tisícro&#269;í pred n. l., takže samotný vznik písma treba klás&#357; do 
      ešte skorších &#269;ias.</P>
      <P>Písmo samotné samozrejme nemohlo vzniknú&#357; bez nájdenia vhodného 
      zapisovacieho média (kame&#328;, hlinené tabu&#318;ky at&#271;.). Až toto zapisovacie 
      médium umožnilo vlastnú konzerváciu (pamätanie) informácie a&nbsp;tým aj 
      jej prenos v&nbsp;priestore, z&nbsp;jedného miesta na druhé, 
      a&nbsp;v&nbsp;&#269;ase, z&nbsp;generácie na generáciu. Tým sa umožnila 
      akumulácia poznatkov.</P>
      <P>Zaujímavou ilustráciou dôležitosti akumulácie poznatkov pre rozvoj 
      civilizácie je skuto&#269;nos&#357;, že skvelé africké civilizácie udržovali krok 
      s&nbsp;ostatným civilizovaným svetom, alebo ho dokonca vo vzdelanosti 
      pred&#269;ili, len do tých &#269;ias, kým sa bolo možné uspokoji&#357; s&nbsp;pamätaním 
      informácie v&nbsp;hlavách jednotlivcov a&nbsp;s ústnym prenosom tejto 
      informácie. Akonáhle množstvo vedomostí za&#269;alo prevyšova&#357; tieto schopnosti 
      (a potrebovalo teda by&#357; iná&#269; pamätané) došlo&nbsp;k&nbsp;stagnácii 
      a&nbsp;úpadku. <A href="http://en.wikipedia.org/wiki/Sankore_University" 
      target=_blank>Univerzita v&nbsp;Timbuktu</A> (dnešné <A 
      href="http://en.wikipedia.org/wiki/Mali" target=_blank>Mali</A>) a&nbsp;aj 
      ostatné strediská africkej vzdelanosti, nespoznali písmo – a&nbsp;nielen 
      že zanikli, ale aj na dlhú dobu upadli do zabudnutia.</P>
      <P>Akumuláciou poznatkov sa za&#269;ala umoc&#328;ova&#357; výkonnos&#357; &#318;udského mozgu. 
      Kvalitatívny skok v&nbsp;tomto procese však nastal až ke&#271; sa za&#269;ali 
      používa&#357; <A href="http://en.wikipedia.org/wiki/Papyrus" 
      target=_blank>papyrus</A> a&nbsp;papier ako zapisovacie (pamä&#357;ové) 
      médiá.</P>
      <P>Na papyrus, ktorý bol lacný, dostupný, prenosite&#318;ný a&nbsp;trvanlivý, 
      sa písalo spo&#269;iatku štetcom, neskôr rákosovým perom. Písa&#357; sa dalo už 
      pomerne rýchlo takže obrázkový charakter písma za&#269;al zdržova&#357;. Pisári 
      za&#269;ali vymýš&#318;a&#357; skratky, zjednodušenia. Tu niekde za&#269;al proces, ktorý 
      viedol od obrázkového písma&nbsp;k&nbsp;abecedám. "Vynález" abecedy sa 
      dnes pripisuje moreplavbe a&nbsp;obchodu holdujúcim – a&nbsp;teda 
      flexibilné písmo vyžadujúcim&nbsp;–&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Phoenicia" target=_blank>Feni&#269;anom</A>, 
      od ktorých ju prevzali (a upravili) <A 
      href="http://en.wikipedia.org/wiki/Ancient_Greece" target=_blank>Gréci</A> 
      a&nbsp;neskôr <A href="http://en.wikipedia.org/wiki/Ancient_Rome" 
      target=_blank>Rimania</A>.</P>
      <P>Papyrus zásadne prispel k rozvoju staroegyptskej vzdelanosti 
      a&nbsp;Egyp&#357;ania ako monopolní výrobcovia papyrusu si skoro uvedomili, že 
      je to strategický materiál. Od dynastie <A 
      href="http://en.wikipedia.org/wiki/Ptolemy" 
      target=_blank>Ptolemaiovcov</A> bol každý kúsok papyrusu vyhlásený za 
      majetok faraóna a&nbsp;mohol by&#357; používaný len v&nbsp;štátnom zaujme 
      a&nbsp;len k tomu oprávnenými pisármi. Zárove&#328; bol uzákonený zákaz vývozu 
      papyrusu, aby bolo nadosta&#269; písacieho materiálu pre krá&#318;ovské archívy, 
      a&nbsp;predovšetkým pre alexandrijské knižnice, kde sa sústre&#271;ovali všetky 
      vedomosti vtedajšieho sveta.</P>
      <P>Uvalením embarga (pravdepodobne prvého v&nbsp;dejinách &#318;udstva 
      týkajúceho sa "hardwaru" informa&#269;nej techniky) sa dostalo do nepríjemnej 
      situácie Grécko a&nbsp;hlavne Rím. Rímske vydavate&#318;stvá, v&nbsp;ktorých 
      desiatky až stovky pisárov pod&#318;a diktátu paralelne prepisovali 
      pred&#269;ítavaný text, neboli schopné kry&#357; požiadavky bohá&#269;ov, ktorí, pod&#318;a 
      gréckeho vzoru, zhromaž&#271;ovali cenné zvitky papyrusu.</P>
      <P>Do&#269;asné riešenie sa našlo vo forme <A 
      href="http://en.wikipedia.org/wiki/Parchment" target=_blank>pergamenu</A> 
      (&#269;esky "b&#283;lpuch“), &#269;o je vlastne dokonale vypracovaná a&nbsp;vybielená 
      koža jahniat, oviec, kôz alebo teliat. Pergamen sú&#269;asne umožnil, ako sa 
      o&nbsp;tom zmie&#328;uje aténsky filozof a&nbsp;historik Plubarchios, jeden 
      z&nbsp;prvých dômyselných spôsobov kódovania. Úzky pruh pergamenu sa 
      navinul šikmo po d&#314;žke na drevenú ty&#269;. Správa, ktorá mala by&#357; utajená, sa 
      potom napísala po d&#314;žke ty&#269;e na pergamen. Rozvinutý pruh pergamenu mohol 
      dekódova&#357; len adresát vybavený ty&#269;ou o&nbsp;rovnakom priemere.</P>
      <P>Papier, ako zatia&#318; hlavné zapisovacie médium pre medzi&#318;udskú 
      komunikáciu, vynašiel, prakticky v&nbsp;dnešnej forme, &#269;ínsky minister 
      orby&nbsp; <A href="http://en.wikipedia.org/wiki/Cai_Lun" 
      target=_blank>Ts'ai–Lun</A> okolo roku 100 n. l.. Do tej doby písali 
      &#268;í&#328;ania na tenké bambusové plátky, pospájané &#269;apmi, &#269;o bolo nešikovné 
      a&nbsp;nákladné. Z &#268;íny sa papier pomaly rozšíril cez Kóreu do Japonska 
      a&nbsp;na druhú stranu – hlavne ako prostriedok šírenia koránu – cez <A 
      href="http://en.wikipedia.org/wiki/Samarkand" target=_blank>Samarkand</A>, 
      <A href="http://en.wikipedia.org/wiki/Baghdad" target=_blank>Bagdad</A> 
      (r. 794), <A href="http://en.wikipedia.org/wiki/Jemen" 
      target=_blank>Jemen</A>, <A href="http://en.wikipedia.org/wiki/Egypt" 
      target=_blank>Egypt</A>, <A href="http://en.wikipedia.org/wiki/Palestine" 
      target=_blank>Palestínu</A>, Severnú Afriku až na Pyrenejský polostrov, 
      ktorý bol vtedy v&nbsp;moci <A href="http://en.wikipedia.org/wiki/Moors" 
      target=_blank>Maurov</A>. Tým sa dostal papier do Európy.</P>
      <P>Už v&nbsp;roku 1370 povolal <A 
      href="http://en.wikipedia.org/wiki/Karel_IV" target=_blank>Karel IV</A>. 
      papierenských majstrov z&nbsp;Talianska do <A 
      href="http://en.wikipedia.org/wiki/Cheb" target=_blank>Chebu</A>, kde tak 
      vznikla prvá papiere&#328; v&nbsp;Strednej Európe a&nbsp;severne od Álp vôbec. 
      Pre porovnanie, v&nbsp;Nemecku za&#269;ali vyrába&#357; papier v&nbsp;roku 1390, vo 
      Švaj&#269;iarsku v&nbsp;roku 1411, v&nbsp;Anglicku 1494, v&nbsp;Rusku 1576,.v 
      Amerike 1690 a&nbsp;v&nbsp;Turecku 1745. Prvá slovenská papiere&#328; vznikla 
      v&nbsp;roku 1530 v&nbsp;Levo&#269;i.</P>
      <P>Na papier sa písalo ako kedysi na papyrus a&nbsp;popísané hárky sa 
      viazali do <A href="http://en.wikipedia.org/wiki/Book" 
      target=_blank>knihy</A>. Za objav knihy tiež v&#271;a&#269;íme &#268;í&#328;anom (aj slovo 
      kniha je odvodené z&nbsp;&#269;ínskeho "king"). Ru&#269;ne písané knihy boli tiež 
      &#269;asto vzácne a&nbsp;drahé umelecké diela (ich hodnota predstavovala aj 
      cenu stáda dobytka alebo domu). Preto boli knihy v&nbsp;knižniciach bežne 
      pripútané re&#357;azou&nbsp;k&nbsp;&#269;ítaciemu pultu (tzv. libri catenati).</P>
      <P>Používanie papyrusu a&nbsp;papiera umožnilo exponenciálne zvä&#269;šenie 
      množstva informácií uchovávanej a&nbsp;prenášanej &#318;udskou spolo&#269;nos&#357;ou, 
      &#269;ím nastala prvá informa&#269;ná explózia, &#269;o dalo vznik prvej informa&#269;nej 
      revolúcii. Táto revolúcia mala za následok prudký rozvoj kultúry 
      a&nbsp;vedy a&nbsp;viedla postupne&nbsp;k&nbsp;prevratným zmenám 
      v&nbsp;živote spolo&#269;nosti a&nbsp;jednotlivca.</P>
      <P>Novej nastupujúcej dobe už nesta&#269;il stredoveký rytier – kulturista, 
      ktorý sa vedel šikovne ohá&#328;a&#357; me&#269;om, po nociach drsne zabáva&#357; 
      a&nbsp;namiesto podpisu ot&#341;&#269;ajúci svoj palec, ani jeho 
      prototyp&nbsp;–&nbsp;zbožný mních. Nastupujúca renesancia vytvorila ideál 
      "homo universale" – všestranne rozvinutého &#269;loveka, ktorý ovláda nieko&#318;ko 
      jazykov, literatúru, dejiny, základy vtedajšej vedy, politiku, obchod, hru 
      na hudobné nástroje at&#271;.</P>
      <P>Je nesporné, že tieto prevratné zmeny v&nbsp;živote spolo&#269;nosti 
      a&nbsp;jednotlivca boli v&nbsp;podstate dôsledkom relatívne bezvýznamnej 
      skuto&#269;nosti: podstatnej miniaturizácii, podstatného zrýchlenia 
      a&nbsp;zlacnenia výroby a&nbsp;podstatného zvä&#269;šenia prenosite&#318;nosti 
      základných pamä&#357;ových médií pre alfanumerickú informáciu (papyrusu 
      a&nbsp;papiera) a&nbsp;zjednodušenia spôsobu zapisovania (abeceda).</P>
      <P>Prudký rozvoj kultúry, vedy a&nbsp;techniky, podnietený prvou 
      informa&#269;nou explóziou (najmä v&nbsp;astronómii, matematike, lekárstve, 
      baníctve, literatúre at&#271;.), však &#269;oskoro za&#269;al naliehavo potrebova&#357; 
      vhodnejší, rýchlejší, flexibilnejší a&nbsp;lacnejší prostriedok na zápis 
      a&nbsp;šírenie informácie, ako boli pisárne kláštorov alebo 
      vydavate&#318;stiev. Tento prostriedok sa &#269;oskoro našiel a&nbsp;bola ním 
      kníhtla&#269;.</P>
      <P>Myšlienka tla&#269;i&#357; a&nbsp;nie prácne písa&#357; a&nbsp;kresli&#357; je prastará. 
      Vä&#269;šina starovekých civilizácií používala razidlá a&nbsp;pe&#269;atidlá – na 
      tla&#269; do tvárneho podkladu – na ktorých boli okrem firemných zna&#269;iek &#269;asto 
      celé vety zaklínadiel, dlhé tituly a&nbsp;pod. Tla&#269; obrázkov na rovný 
      povrch porcelánu poznali &#268;í&#328;ania už v&nbsp;11. storo&#269;í odkia&#318; bol už len 
      krok k tla&#269;i na papier. Dôležitým &#271;alším krokom bola doskotla&#269;. V&nbsp;14. 
      storo&#269;í za&#269;ali &#318;udia vyrezáva&#357; obrázky na drevené došti&#269;ky, tieto natiera&#357; 
      sadzami v&nbsp;oleji, a&nbsp;otlá&#269;a&#357; znova a&nbsp;znova na papier. (Je 
      prízna&#269;né, že prvé aplikácie doskotla&#269;e slúžili pre zábavu – na tla&#269; 
      hracích kariet. Zaujímavú analógiu vidíme pri nástupe mikroelektroniky.) 
      Okolo roku 1400 už boli doskotla&#269;ou vydávané aj malé knižo&#269;ky – akési 
      "instanty" – napr. sten&#269;ené, ilustrované vý&#328;atky z&nbsp;biblie, stru&#269;ná 
      gramatika latin&#269;iny a&nbsp;pod.</P>
      <DIV class=img_divl><IMG title="Johann Gutenberg" 
      style="WIDTH: 253px; HEIGHT: 325px" alt="Johann Gutenberg" 
      src="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/gutenberg.jpg"><BR>Johann 
      Gutenberg <A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#zdroje">[2]</A></DIV>
      <P>Kníhtla&#269; vynašli &#268;í&#328;ania, ale Európa o&nbsp;tom nevedela. A&nbsp;musela 
      &#269;aka&#357; na <A href="http://en.wikipedia.org/wiki/Johann_Gutenberg" 
      target=_blank>Johanna Gutenberga</A> (1398 –&nbsp;1468), mohu&#269;ského rodáka 
      a&nbsp;vyu&#269;eného zlatníka, ktorý sa stal otcom modernej kníhtla&#269;e. 
      Gutenberga napadlo vyreza&#357; jednotlivé písmená abecedy z&nbsp;bukovej kôry, 
      odlia&#357; ich do cínu (z každého písmenka ve&#318;a exemplárov) 
      a&nbsp;z&nbsp;písmen sklada&#357; slová, vety a&nbsp;celé stránky kníh! Navyše 
      vylepšil aj tla&#269;iarenskú &#269;er&#328;. Prvou skuto&#269;nou knihou, ktorá roku 1452 
      vyšla z&nbsp;Gutenbergovho tla&#269;iarenského lisu, bola znamenitá tzv. <A 
      href="http://en.wikipedia.org/wiki/Gutenberg_Bible" 
      target=_blank>Tridsa&#357;šes&#357;riadková biblia</A>.</P>
      <P>Je zaujímavé, že ciele, ktoré viedli Gutenberga k zostrojeniu 
      tla&#269;iarenského stroja, boli celkom iné než masová tla&#269; kníh. Jeho pôvodným 
      cie&#318;om bolo tla&#269;i&#357; len "medziprodukty"&nbsp;–&nbsp;tla&#269;ené predlohy pre 
      pisárov. S&#318;uboval si od toho podstatné zmenšenie po&#269;tu chýb v&nbsp;opisoch 
      v&nbsp;porovnaní s&nbsp;paralelnými opismi na základe pred&#269;ítavania. (Je 
      tiež možné, že v&nbsp;tej dobe si bolo &#357;ažko predstavi&#357;, že tla&#269;enie 
      (posvätných) kníh sa dá zveri&#357; stroju!)</P>
      <P>K rozšíreniu kníhtla&#269;e prispela vojna medzi biskupmi Ditrichom 
      z&nbsp;Isenbergu a&nbsp;Adolfom Nasavským&nbsp;o&nbsp;pohodlné biskupské 
      sídlo. Žoldnieri Nasavského zapálili <A 
      href="http://en.wikipedia.org/wiki/Mohacs" target=_blank>Mohá&#269;</A>, 
      Gutenbergove tla&#269;iarne vyhoreli a&nbsp;majstri s&nbsp;tovarišmi sa 
      rozutekali do celej Európy.</P>
      <P>Prvá &#269;eská kniha – biblia – bola vydaná v&nbsp;Plzni r.&nbsp;1467. 
      Všimnime si, že tak isto ako korán – oficiálna "ideológia" vládnucej 
      triedy – prispel&nbsp;k&nbsp;rozšíreniu papiera vo svete, tak aj biblia 
      prispela k rozšíreniu kníhtla&#269;e.</P>
      <P>Kníhtla&#269;iarne za&#269;ali rás&#357; ako huby po daždi. V&nbsp;roku 1480 už vyšlo 
      okolo 8000 titulov s&nbsp;celkovým nákladom okolo 1&nbsp;600&nbsp;000 
      kníh. Zo za&#269;iatku boli knihy poplatné minulosti: ru&#269;ne ilustrované 
      a&nbsp;zdobené, v&nbsp;koži viazané a&nbsp;teda zna&#269;ne drahé. Skuto&#269;ný 
      rozvoj kníhtla&#269;e preto nastal, až ke&#271; vydavatelia pochopili, že kniha nie 
      je prepychový, ale úžitkový predmet širokých más a&nbsp;knihy sa stali 
      triezvejšie, menšie a&nbsp;lacnejšie.</P>
      <P>Kníhtla&#269; umožnila &#271;alšie exponenciálne zvä&#269;šenie množstva informácií. 
      Nastala druhá informa&#269;ná explózia, &#269;o dalo vznik druhej informa&#269;nej 
      revolúcii, ktorá viedla&nbsp;k&nbsp;priemyselnej revolúcii.</P>
      <P>Všimnime si, že tieto revolu&#269;né zmeny boli v&nbsp;podstate opä&#357; 
      dôsledkom podstatného zrýchlenia a&nbsp;zlacnenia výroby, &#271;alšej 
      miniaturizácie a&nbsp;zlepšenia prenosite&#318;nosti základného pamä&#357;ového 
      média – knihy. Tieto zmeny neboli síce kvantitatívne tak ve&#318;ké ako pri 
      prechode od kame&#328;a a&nbsp;hlinených tabuliek k papyrusu a&nbsp;papieru, 
      ale predsa len umožnili skok, ktorým sa umožnilo, po prvýkrát, masové 
      používanie a&nbsp;šírenie zapamätanej informácie potenciálne každým &#269;lenom 
      spolo&#269;nosti – a&nbsp;to bol základ revolu&#269;ných zmien 
      v&nbsp;spolo&#269;nosti.</P>
      <P>Masová produkcia kníh umožnila a&nbsp;sú&#269;asne si aj vynútila zavedenie 
      povinnej výu&#269;by &#269;ítania a&nbsp;písania a&nbsp;sú&#269;asne povinnej školskej 
      dochádzky.</P>
      <P>Po dobu vyše 500 rokov bol tla&#269;ený text prakticky hlavným masovým 
      prostriedkom pre pamätanie informácie, medzi&#318;udskej komunikácie 
      a&nbsp;získavanie poznatkov. Až v&nbsp;posledných rokoch nastáva zmena. 
      Štatistiky hovoria, že priemerné die&#357;a v&nbsp;USA strávi týždenne 25 hodín 
      pri tla&#269;enom materiáli, ale 28 hodín pri elektronických u&#269;ebných 
      prostriedkoch.</P>
      <DIV class=img_divl><IMG title="Jacquardov tká&#269;sky stroj" 
      style="WIDTH: 249px; HEIGHT: 333px" alt="Jacquardov tká&#269;sky stroj" 
      src="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/jacquard_loom_hooks.jpg"><BR>Jacquardov 
      tká&#269;sky stroj <A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#zdroje">[3]</A></DIV>
      <P>História pamä&#357;ových médií pre komunikáciu &#269;loveka so strojmi za&#269;ína asi 
      v&nbsp;14. storo&#269;í, ke&#271; sa za&#269;ali používa&#357; rôzne médiá ako "rotating 
      pegged cylinder" na riadenie hracích skriniek a&nbsp;hudobných nástrojov – 
      organy a&nbsp;pod. (V&nbsp;r.&nbsp;1736 Vaucauson zostrojil automat, ktorý 
      simuloval pohyb perí a&nbsp;prstov s&nbsp;presnos&#357;ou dostato&#269;nou na hranie 
      na flaute.)</P>
      <P>Najdôležitejší však bol vývoj pamä&#357;ových médií pre riadenie tká&#269;skych 
      strojov. Za&#269;al ho <A href="http://en.wikipedia.org/wiki/Basile_Bouchon" 
      target=_blank>B. Bouchon</A>, ktorý v&nbsp;r.&nbsp;1725 použil na tento 
      ú&#269;el diernu pásku. J.&nbsp;B.&nbsp;Falcon ju nahradil diernymi štítkami. 
      Ke&#271; v&nbsp;r.&nbsp;1765 zomrel, bolo asi 40 takých tká&#269;skych strojov 
      v&nbsp;používaní. Podstatné vylepšenie urobil <A 
      href="http://en.wikipedia.org/wiki/Joseph_Marie_Jacquard" 
      target=_blank>Joseph Marie Jacquard</A> (1752 – 1834).</P>
      <P>Jeho tká&#269;sky stroj patrí k ve&#318;kým vynálezom, ktorým v&nbsp;r.&nbsp;1805 
      za&#269;ala revolúcia v&nbsp;tká&#269;skom priemysle. (Už v&nbsp;r.&nbsp;1812 bolo 
      11 000 Jacquardových tká&#269;skych strojov vo Francii.)</P>
      <P>Ako uvidíme v&nbsp;&#271;alšom, dierne štítky boli aj prvým pamä&#357;ovým médiom 
      pre styk &#269;loveka s&nbsp;po&#269;íta&#269;om.</P>
      <P>Význam objavov Bouchona a&nbsp;Falcona spo&#269;íva v&nbsp;poznaní, že pre 
      komunikáciu so strojom sta&#269;í binárna informácia. Vznik magnetickej pásky 
      bol potom už len prirodzenou reakciou na novú technológiu.</P>
      <P>Pre úplnos&#357; spome&#328;me ešte pamä&#357;ové médiá pre zvuková informáciu 
      (gramofónové platne r.&nbsp;1920 a&nbsp;magnetická pásky r.&nbsp;1956) 
      a&nbsp;obrazovú informáciu (fotografiu r.&nbsp;1839 a&nbsp;film 
      r.&nbsp;1890).</P>
      <DIV style="TEXT-ALIGN: right"><A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#start">spa&#357; 
      na obsah</A></DIV>
      <H3><A name=2_2></A>2.2 PRENOS INFORMÁCIE</H3>
      <P>Hlavné zapisovacie materiály, papyrus a&nbsp;papier, umož&#328;ujú 
      jednorazový zápis informácie a&nbsp;&#318;ubovo&#318;ný po&#269;et &#269;ítaní (tzv. read–only 
      memory). Až do objavenia kníhtla&#269;e bol "zapisovacím procesorom" &#269;lovek 
      a&nbsp;až tla&#269;iarenský stroj ho zbavil, tejto úlohy a&nbsp;umožnil 
      vytvára&#357; prakticky &#318;ubovo&#318;né množstvo kópií tej istej informácie.</P>
      <P>Pamä&#357; takého druhu (ako je napr. kniha) slúži teda hlavne ku 
      konzervácii informácie. Dá sa však použi&#357; aj na prenos 
      informácie&nbsp;–&nbsp;prenášaním, resp. posielaním. Od pradávna sa 
      s&nbsp;týmto ú&#269;elom používali poslovia, kuriéri, poštové holuby 
      a&nbsp;dokonca aj v&#269;ely. Tento spôsob prenosu informácie bol však 
      odjakživa pre vojenské ú&#269;ely neúnosne pomalý a&nbsp;postupne sa to za&#269;alo 
      poci&#357;ova&#357; aj v&nbsp;obchode a&nbsp;žurnalistike. (Rýchly prenos informácie 
      umož&#328;uje nielen rýchlejšiu akumuláciu poznatkov, ale aj ich efektívnejšie 
      využívanie.)</P>
      <P>Pre svoje potreby tento problém uspokojivo vyriešili už dávno 
      v&nbsp;Afrike (žeby kompenzácia za neznalos&#357; písma?), kde ešte doteraz 
      využívajú domorodci na šírenie správ sie&#357; špeciálnych obrovských bubnov 
      (tzv. <A href="http://en.wikipedia.org/wiki/Drum_(communication)" 
      target=_blank>lokalí</A>), pomocou ktorých dokážu cvi&#269;ení bubeníci 
      prenáša&#357; &#318;ubovo&#318;né správy na ve&#318;ké vzdialenosti ve&#318;kou rýchlos&#357;ou.</P>
      <P>Svet novoveku sa s&nbsp;týmto problémom &#269;iasto&#269;ne vysporiadal až ke&#271; 
      v&nbsp;roku 1837 <A href="http://en.wikipedia.org/wiki/Samuel_F._B._Morse" 
      target=_blank>S.&nbsp;F.&nbsp;B.&nbsp;Morse</A> (1791&nbsp;–&nbsp;1872) 
      vynašiel <A href="http://en.wikipedia.org/wiki/Telegraph" 
      target=_blank>telegraf</A>. Prvá prevádzka za&#269;ala v&nbsp;roku 1844 na 64 
      km dlhej linke medzi <A 
      href="http://maps.google.com/maps?f=d&amp;hl=en&amp;saddr=washington+DC&amp;daddr=baltimore&amp;sll=43.481425,-99.756475&amp;sspn=41.868314,56.425781&amp;ie=UTF8&amp;z=10&amp;om=1" 
      target=_blank>Washingtonom a&nbsp;Baltimorom</A> a&nbsp;už 
      v&nbsp;r.&nbsp;1858 bola spojená Európa s&nbsp;Amerikou <A 
      href="http://en.wikipedia.org/wiki/Transatlantic_telegraph_cable" 
      target=_blank>podmorským káblom</A>.</P>
      <P>Telegraf mal však podobnú nevýhodu ako africké bubny – používa&#357; ho 
      vedeli len "zasvätení". Hoci tento nedostatok sa neskôr odstránil 
      a&nbsp;telegraf sa vyvinul až do formy dnešného &#271;alekopisu, jeho masovému 
      rozšíreniu bránila nutnos&#357; špeciálneho kódovania a&nbsp;dekódovania 
      správ.</P>
      <P>V roku 1861 predviedol nemecký u&#269;ite&#318; <A 
      href="http://en.wikipedia.org/wiki/Johann_Philipp_Reis" 
      target=_blank>Filip Reis</A> vo fyzikálnom spolku mesta Frankfurt aparát 
      na prenos &#318;udského hlasu na dia&#318;ku – bez vä&#269;šieho ú&#269;inku na pánov 
      profesorov. O&nbsp;tom sa dozvedel <A 
      href="http://en.wikipedia.org/wiki/Alexander_Graham_Bell" 
      target=_blank>Alexander Graham Bell</A> (1847 – 1922), u&#269;ite&#318; hluchonemých 
      v&nbsp;Bostone, USA. Myslel si, že taký prístroj by sa mu zišiel pri 
      výu&#269;be hluchonemých. Ale &#269;oskoro vytušil, že telefón – lebo on to bol – je 
      &#269;osi ove&#318;a významnejšie. Na svetovej výstave vo Philadelphii r.&nbsp;1876 
      je už Bell so svojim telefónom atrakciou &#269;íslo jedna.</P>
      <P>Do roku 1901 bol telefón luxusným prostriedkom komunikácie pre bohatých 
      a&nbsp;dôležité úrady a&nbsp;podniky. Okolo roku 1900 za&#269;ala firma Bell 
      Company obrovskú kampa&#328; s&nbsp;cie&#318;om dosta&#357; telefón do masového užívania 
      a&nbsp;do "každej domácnosti". Kampa&#328; bola úspešná a&nbsp;masové 
      používanie telefónu malo podstatný vplyv na urýchlenie priemyselnej 
      revolúcie.</P>
      <P>&#270;alším ve&#318;mi významným krokom v&nbsp;oblasti prenosu informácie bol 
      vynález bezdrôtovej telegrafia (<A 
      href="http://en.wikipedia.org/wiki/Alexander_Stepanovich_Popov" 
      target=_blank>A. S. Popov</A> 1890 a&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Guglielmo_Marconi" 
      target=_blank>G.&nbsp;Marconi</A> 1896) a&nbsp;rádia. Prvú vysiela&#269;ku mala 
      vzducholo&#271; <A href="http://en.wikipedia.org/wiki/Zeppelin" 
      target=_blank>Zeppelin</A> v&nbsp;r.&nbsp;1911 a&nbsp;prvú rádiovú stanicu 
      dali do prevádzky v&nbsp;Pittsburgu v&nbsp;r.&nbsp;1920. V&nbsp;roku 1923 
      (presnejšie 18.5.1923&nbsp;o&nbsp;20:15) už vysielal aj oficiálny 
      &#269;eskoslovenský rozhlas z&nbsp;Gbiel a&nbsp;Prahy.</P>
      <P>Sú&#269;asne s&nbsp;prenosom akustickej informácie sa &#318;udia pokúšali aj 
      o&nbsp;prenos obrazovej informácie. Zo za&#269;iatku po drôtoch (<A 
      href="http://en.wikipedia.org/wiki/Alexander_Bain" target=_blank>A. 
      Bain</A>, 1843), neskôr bez drôtov (<A 
      href="http://en.wikipedia.org/wiki/John_Logie_Baird" target=_blank>J. 
      Baird</A>, 1908). Princíp televízora objavil <A 
      href="http://en.wikipedia.org/wiki/Paul_Gottlieb_Nipkow" target=_blank>P. 
      Nipkow</A> r.&nbsp;1884 a&nbsp;prvé televízne vysielanie sa uskuto&#269;nilo 
      v&nbsp;r. 1926&nbsp;vo Ve&#318;kej Británii – teda len štyri roky po založení 
      <A href="http://en.wikipedia.org/wiki/BBC" target=_blank>BBC</A>. Prvé 
      televízne vysielanie v&nbsp;&#268;eskoslovensku sa uskuto&#269;nilo 
      v&nbsp;r.&nbsp;1953.</P>
      <P>Prostriedky na prenos informácie, ktoré sme tu uviedli, stáli bu&#271; pri 
      zrode priemyselnej revolúcie, prípadne podstatne prispeli k jej rozvoju 
      a&nbsp;tvoria technologickú základ&#328;u tretej informa&#269;nej explózie 
      a&nbsp;tretej informa&#269;nej revolúcie, ktorej sme už priamymi svedkami 
      a&nbsp;aktérmi.</P>
      <P>Do nedávna nám však chýbali prostriedky, ktoré by spájali prednosti 
      zariadení na pamätanie a&nbsp;prenos informácie, t. j. v&nbsp;ktorých by 
      sa dala informácia konzervova&#357; a&nbsp;akumulova&#357;, prenáša&#357; z&nbsp;jedného 
      zariadenia na druhé a&nbsp;navyše efektívne vyh&#318;adáva&#357; pre bezprostredné 
      použitie, resp. transformova&#357; na "odvodenú" informáciu.</P>
      <DIV style="TEXT-ALIGN: right"><A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#start">spa&#357; 
      na obsah</A></DIV>
      <H3><A name=2_3></A>2.3 SPRACOVANIE INFORMÁCIE</H3>
      <P>Tisícro&#269;ia bol &#269;lovek najdokonalejším a&nbsp;najvýkonnejším systémom 
      pre spracovanie informácie, ktorý sám seba zdokona&#318;oval.</P>
      <P>Prehistória strojov na spracovanie informácie za&#269;ína ke&#271; &#269;lovek zistil, 
      že môže fyzicky reprezentova&#357; (pamäta&#357;) &#269;ísla. Za prvý prístroj na 
      po&#269;ítanie, t. j. na skracovanie numerickej informácie, sa považuje <A 
      href="http://en.wikipedia.org/wiki/Abacus" target=_blank>abakus</A>, aj 
      ke&#271; v&nbsp;podstate je to len prvá read–and–write pamä&#357;, s&nbsp;ktorou 
      &#269;lovek dokázal obratne manipulova&#357;. Abakus, starý asi 5000 rokov, sa 
      prekvapujúco používa dodnes, napr. v&nbsp;krajinách bývalého <A 
      href="http://en.wikipedia.org/wiki/Soviet_Union" 
      target=_blank>ZSSR</A>.</P>
      <P>Modernejšia história za&#269;ína asi&nbsp;u&nbsp;iránskeho astronóma 
      a&nbsp;matematika <A 
      href="http://www-history.mcs.st-andrews.ac.uk/Biographies/Al-Kashi.html" 
      target=_blank>Jamshid ben Mas'ud ben Mahmud Ghiath ed–Den al–Kashiho</A> 
      (1390&nbsp;–&nbsp;1450), ktorý zostrojil celý rad dôvtipných (analógových) 
      prístrojov na u&#318;ah&#269;enie astronomických výpo&#269;tov.</P>
      <P>&#270;alej je tu skvelý matematik a&nbsp;vynálezca, škót <A 
      href="http://en.wikipedia.org/wiki/John_Napier" target=_blank>John 
      Napier</A> (1550&nbsp;–&nbsp;1617). Ako vynálezca vraj zostrojil zbra&#328; 
      "<SPAN style="FONT-STYLE: italic">schopnú zabi&#357; všetok dobytok 
      v&nbsp;okruhu jednej míle</SPAN>". Zhrozený Napier odmietol zbra&#328; &#271;alej 
      vyvíja&#357; a&nbsp;upadla do zabudnutia. Komer&#269;ne úspešné bolo zariadenie 
      nazývané Napier Bones, v&nbsp;ktorom, na drevených cylindroch, boli 
      uložené multiplikatívne tabu&#318;ky a&nbsp;otá&#269;aním cylindrov sa dali 
      vykonáva&#357; aritmetické operácie.</P>
      <P>Napier sa zaoberal históriou pozi&#269;ných &#269;íselných sústav, poznal binárnu 
      sústavu a&nbsp;bol vraj asi prvým kto pochopil používanie desatinnej 
      &#269;iarky v&nbsp;aritmetických operáciách. Jeho hlavným prínosom je objavenie 
      logaritmov a&nbsp;publikovanie, po 25 rokoch úmornej práce, logaritmických 
      tabuliek.</P>
      <P>Je pozoruhodné, že vynálezca Napier objavil logaritmy, ale nevynašiel 
      logaritmické pravítko. Zostrojil ho v&nbsp;r.&nbsp;1632 <A 
      href="http://en.wikipedia.org/wiki/William_Oughtred" target=_blank>W. 
      Oughtred</A>. <A href="http://en.wikipedia.org/wiki/Slide_rule" 
      target=_blank>Logaritmické pravítko</A> je prvým viacú&#269;elovým analógovým 
      strojom na spracovanie informácie, ktorý sa dosia&#318; používa všade tam, kde 
      ho ešte nevytla&#269;ili elektronické kalkula&#269;ky.</P>
      <P>História &#269;íslicových strojov na spracovanie informácie za&#269;ína za&#269;iatkom 
      17. storo&#269;ia. To nie je náhoda. Rok 1600 sa považuje za prelom 
      v&nbsp;histórii vedy. <A 
      href="http://en.wikipedia.org/wiki/Galileo_Galilei" target=_blank>Galileo 
      Galilei</A> (1564&nbsp;–&nbsp;1642) dokázal matematizova&#357; fyziku, spoji&#357; 
      praktické a&nbsp;experimentálne poznanie s&nbsp;matematikou, da&#357; výsledkom 
      fyzikálnych experimentov "<SPAN style="FONT-STYLE: italic">magický dotyk 
      matematických formúl</SPAN>". Nastal ve&#318;ký rozvoj fyziky a&nbsp;matematiky 
      a&nbsp;vedy vôbec a&nbsp;tým aj potreba rozsiahlejších výpo&#269;tov.</P>
      <P>Ako uvidíme v&nbsp;&#271;alšom, zásadný pokrok v&nbsp;oblasti strojov na 
      spracovanie informácie nastával vždy vtedy, ke&#271; nejaký &#318;udský génius si 
      uvedomil akútnu spolo&#269;enskú potrebu kvalitatívne nových výpo&#269;tových 
      prostriedkov a&nbsp;dokázal pre tento ú&#269;el využi&#357; novú technológiu.</P>
      <P>Dnes sa už zabúda, že po&#269;as nieko&#318;kých storo&#269;í bola astronómia vedou 
      s&nbsp;najvä&#269;šími praktickými aplikáciami, najmä pre moreplavbu, a&nbsp;že 
      potreba presných astronomických výpo&#269;tov, najmä presných tabuliek 
      mesa&#269;ných pozícií, bola hnacou silou ako pre rozvoj matematiky, tak aj pre 
      rozvoj výpo&#269;tovej techniky.</P>
      <DIV class=img_divr><IMG title="Rekonštrukcia Schickardovej kalkula&#269;ky" 
      style="WIDTH: 216px; HEIGHT: 163px" 
      alt="Rekonštrukcia Schickardovej kalkula&#269;ky" 
      src="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/schickard_calculator_b.gif"><BR>Rekonštrukcia 
      Schickardovej kalkula&#269;ky <A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#zdroje">[4]</A></DIV>
      <P>Prvú &#269;íslicovú kalkula&#269;ku zostrojil <A 
      href="http://en.wikipedia.org/wiki/Wilhelm_Schickard" 
      target=_blank>W.&nbsp;Schickard</A> (1592&nbsp;–&nbsp;1535), profesor 
      astronómie, matematiky a&nbsp;hebrej&#269;iny v&nbsp;<A 
      href="http://en.wikipedia.org/wiki/TÃ¼bingen" target=_blank>Tübingene</A>. 
      Historicky významnejšie boli kalkula&#269;ky zostrojené geniálnymi de&#357;mi, 
      výnimo&#269;nými matematikmi a&nbsp;filozofmi, B.&nbsp;Pascalom 
      a&nbsp;G.&nbsp;Leibnizom. Všetky tieto kalkula&#269;ky boli založené na idei 
      známej už v&nbsp;1&nbsp;storo&#269;í n. l. <A 
      href="http://en.wikipedia.org/wiki/Hero_of_Alexandria" 
      target=_blank>Heronovi z&nbsp;Alexandrie</A>, (vynálezcovi parného stroja, 
      tzv. <A href="http://en.wikipedia.org/wiki/Aeolipile" 
      target=_blank>Aeolipile</A>) t. j. že &#269;íslo môžeme reprezentova&#357; 
      postupnos&#357;ou desa&#357;zubových koliesok a&nbsp;pri&#269;ítanie jednotky realizova&#357; 
      tak, že plné oto&#269;enie jedného kolieska zaprí&#269;iní oto&#269;enie kolieska pre 
      vyšší rád o&nbsp;jeden zub.</P>
      <P>Schickardova kalkula&#269;ka zostrojená (v&nbsp;jedinom kuse?) v&nbsp;roku 
      1623 automaticky s&#269;ítavala a&nbsp;od&#269;ítavala a&nbsp;poloautomaticky 
      násobila a&nbsp;delila. Schickard zomrel na mor a&nbsp;kalkula&#269;ka zapadla 
      do zabudnutia. (Jej ná&#269;rty boli objavené v&nbsp;r.&nbsp;1957 
      v&nbsp;Schickardovom liste J. Keplerovi.)</P>
      <DIV class=img_divr><IMG title=Pascaline 
      style="WIDTH: 250px; HEIGHT: 136px" alt=Pascaline 
      src="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/pascaline.jpg"><BR>Pascaline 
      <A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#zdroje">[5]</A></DIV>
      <P><A href="http://en.wikipedia.org/wiki/Blaise_Pascal" 
      target=_blank>Blaise Pascal</A> (1623&nbsp;–&nbsp;1662) sa vraj nemohol 
      díva&#357;, ako jeho otec, da&#328;ový kontrolór, sa trápil nad st&#314;pcami &#269;ísiel 
      a&nbsp;"<SPAN style="FONT-STYLE: italic">zriedka šiel spa&#357; pred druhou 
      v&nbsp;noci</SPAN>". Pascal navrhol asi 50 modelov, kým zostrojil 
      definitívny model kalkula&#269;ky v&nbsp;r.&nbsp;1645. Získal patent 
      a&nbsp;jeho kalkula&#269;ka, Pascaline, v&nbsp;cene 100 <A 
      href="http://en.wikipedia.org/wiki/French_livre" target=_blank>livres</A>, 
      bola na trhu v&nbsp;r.&nbsp;1652. Jeden z&nbsp;exemplárov je v&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Conservatoire_National_des_Arts_et_MÃ©tiers" 
      target=_blank>Conservatoire National des Arts et Métiers</A> 
      v&nbsp;Paríži.</P>
      <P>Vstup &#269;ísiel bol vytá&#269;aním &#269;íslic. Kalkula&#269;ka automaticky s&#269;ítavala 
      a&nbsp;od&#269;ítavala. Násobenie a&nbsp;delenie sa realizovali opakovaným 
      s&#269;ítaním a&nbsp;od&#269;ítaním. (Bola teda menej dokonalá ako Schickardova.) 
      Výstup bol daný pozíciou koliesok v&nbsp;malom okienku. Pascaline bola 
      komer&#269;ným neúspechom. Práca po&#269;tára bola vtedy lacná a&nbsp;výkon 
      Pascaline nevyvážil jej cenu a&nbsp;údržbu.</P>
      <P>Pascaline nadchla <A 
      href="http://en.wikipedia.org/wiki/Gottfried_Leibniz" 
      target=_blank>Gottfrieda Wilhelma Leibniza</A> (1646&nbsp;–&nbsp;1716), 
      ktorý sú&#269;asne videl aj jej slabú stránku – &#357;ažkopádne násobenie 
      a&nbsp;delenie. Tento problém Leibniz vyriešil a&nbsp;jeho ve&#318;kým 
      prínosom, ktorý prežil asi 300 rokov v&nbsp;mechanických kalkula&#269;kách, 
      bolo zavedenie špeciálneho kolieska s&nbsp;desiatimi zubmi rôznej 
      ve&#318;kosti. V&nbsp;roku 1671 Leibniz navrhol kalkula&#269;ku, ale zostrojená bola 
      až v&nbsp;r.&nbsp;1694. Jej tretiu kópiu vyrobili pre <A 
      href="http://en.wikipedia.org/wiki/Peter_I_of_Russia">Petra Ve&#318;kého</A>, 
      ktorý ju daroval &#269;ínskemu cisárovi, aby mu ukázal výsledky vedy 
      a&nbsp;výroby v&nbsp;Európe a&nbsp;tým zlepšil obchod medzi Východom 
      a&nbsp;Západom. Na rozdiel od Pascaline, ktorá výpo&#269;ty len u&#318;ah&#269;ovala, 
      Leibnizova kalkula&#269;ka ich aj zrých&#318;ovala. Ako mnohí géniovia, po zistení 
      "principiálneho riešenia" stratil Leibniz o&nbsp;kalkula&#269;ku záujem 
      a&nbsp;nesnažil sa o&nbsp;jej manufaktúrnu výrobu.</P>
      <P>Isté obdobie bol Leibniz fascinovaný jednoduchos&#357;ou a&nbsp;eleganciou 
      <A 
      href="http://en.wikipedia.org/wiki/Binary_numeral_system#Binary_arithmetic" 
      target=_blank>binárnej aritmetiky</A> a&nbsp;v&nbsp;r.&nbsp;1679 ho 
      napadlo zostroji&#357; kalkula&#269;ku na binárnej aritmetike, ale hlbšie sa touto 
      ideou nezaoberal. Dnes sa zdá, že by to bol býval ve&#318;ký vynález, ktorý by 
      bol viedol k vytvoreniu výkonnej kalkula&#269;ky na parný pohon v&nbsp;18. 
      storo&#269;í, &#269;o by bolo asi urýchlilo vznik a&nbsp;priebeh priemyselnej 
      revolúcie. Leibniz, žijúci v&nbsp;dobe a&nbsp;prostredí, v&nbsp;ktorom sa 
      cenili idey viac ako praktické zariadenia, zrejme nevidel dostato&#269;ný dopad 
      binárnej kalkula&#269;ky a&nbsp;dal prednos&#357; filozofii, logike, kombinatorike, 
      diferenciálnemu a&nbsp;integrálnemu po&#269;tu a&nbsp;založeniu <A 
      href="http://en.wikipedia.org/wiki/Prussian_Academy_of_Sciences" 
      target=_blank>Berlínskej akadémie vied</A>.</P>
      <P>Po Leibnizovi prišli &#271;alší konštruktéri kalkula&#269;iek, ale skuto&#269;ný 
      komer&#269;ný úspech dosiahol až <A 
      href="http://en.wikipedia.org/wiki/Charles_Xavier_Thomas" 
      target=_blank>Thomasov</A> <A 
      href="http://en.wikipedia.org/wiki/Arithmometer" 
      target=_blank>Arithmometer</A> v&nbsp;polovici 19.&nbsp;storo&#269;ia</P>
      <P>Praotcom univerzálnych po&#269;íta&#269;ov je <A 
      href="http://en.wikipedia.org/wiki/Charles_Babbage" target=_blank>Charles 
      Babbage</A> (1791&nbsp;–&nbsp;1871) jedna z&nbsp;najpozoruhodnejších 
      a&nbsp;najrozpornejších postáv modernej vedy. Bol všestranne aktívny, 
      napísal asi 80 prác v&nbsp;matematike, fyzike, astronómii, geológii, 
      ekonómii, štatistike, politike a&nbsp;teológii. Patril k 
      zakladate&#318;om&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Analytical_Society" 
      target=_blank>Analytical society</A>, ktorej cie&#318;om bolo presadzova&#357; 
      Leibnizove a&nbsp;nie <A href="http://en.wikipedia.org/wiki/Isaac_Newton" 
      target=_blank>Newtonove</A> ozna&#269;ovanie v&nbsp;diferenciálno–integrálnom 
      kalkule.</P>
      <P>Babbage bol geniálny, ale excentrický muž, okolo ktorého bolo všetko 
      sporné. Tvrdil, že sa narodil v&nbsp;r.&nbsp;1792 v&nbsp;Londýne, ale 
      narodil sa v&nbsp;r.&nbsp;1791 v&nbsp;Borough of Southwark. Už ako študent 
      v&nbsp;<A href="http://en.wikipedia.org/wiki/University_of_Cambridge" 
      target=_blank>Cambridge</A> urobil s&nbsp;priate&#318;mi dohodu, že sa budú 
      snaži&#357; "<SPAN style="FONT-STYLE: italic">zanecha&#357; svet lepším ako ho 
      našli</SPAN>". Dostal miesto profesora matematiky (1827&nbsp;–&nbsp;1839) 
      v&nbsp;Cambridge, ktoré vo&#318;akedy patrilo Newtonovi, ale v&nbsp;Cambridge 
      nežil ani neu&#269;il. Stýkal sa s&nbsp;vynikajúcimi &#318;u&#271;mi: <A 
      href="http://en.wikipedia.org/wiki/Duke_of_Wellington" target=_blank>Duke 
      of Wellington</A>, <A href="http://en.wikipedia.org/wiki/Robert_Browning" 
      target=_blank>Browning</A>, <A 
      href="http://en.wikipedia.org/wiki/Charles_Darwin" 
      target=_blank>Darwin</A>, <A 
      href="http://en.wikipedia.org/wiki/Charles_Dickens" 
      target=_blank>Dickens</A>, <A 
      href="http://en.wikipedia.org/wiki/Joseph_Fourier" 
      target=_blank>Fourier</A>, <A 
      href="http://en.wikipedia.org/wiki/Alexander_von_Humboldt" 
      target=_blank>Humboldt</A> – ale nevedel vyjs&#357; ani s&nbsp;velikánmi ani 
      s&nbsp;jednoduchými &#318;u&#271;mi. Mal skvelé nápady, ale málo &#269;o dokon&#269;il. 
      Komisia, ktorá po Babbageovej smrti mala za cie&#318; zisti&#357;, &#269;o s&nbsp;jeho 
      pozostalos&#357;ou konštatovala, že "<SPAN style="FONT-STYLE: italic">všetko je 
      príliš neúplné, aby sa to dalo na nie&#269;o použi&#357;</SPAN>". Zomrel ako 
      sklamaný muž, považovaný za &#269;udáka. O&nbsp;jeho genialite však sú&#269;asníci 
      nepochybovali. Jeho mozog podrobne preskúmali a&nbsp;možno ho vidie&#357; 
      v&nbsp;múzeu <A 
      href="http://en.wikipedia.org/wiki/Royal_College_of_Surgeons_of_England" 
      target=_blank>Royal College of Surgens</A> v&nbsp;Londýne.</P>
      <P>Babbage žil v&nbsp;dobe, ke&#271; už zna&#269;ne vzrástla potreba rozsiahlych 
      výpo&#269;tov, najmä v&nbsp;astronómii a&nbsp;nebeskej mechanike. Centrálnym 
      problémom bolo ur&#269;enie pozície Mesiaca ako funkcie &#269;asu. Newton urobil 
      prvý ve&#318;ký pokrok v&nbsp;ur&#269;ení pohybu Mesiaca a&nbsp;skoro všetci ve&#318;kí 
      matematici 18.&nbsp;storo&#269;ia sa pokúšali jeho teóriu vylepši&#357;. Dôležitos&#357; 
      presných tabuliek pozícií Mesiaca bola tak ve&#318;ká pre námorníctvo, pre 
      ur&#269;ovanie polohy lodí, že nieko&#318;ko vlád vypísalo odmenu na ich presné 
      zostrojenie. Prvé tabu&#318;ky, nepresné, zostrojil <A 
      href="http://en.wikipedia.org/wiki/Leonhard_Euler" 
      target=_blank>L.&nbsp;Euler</A> v&nbsp;r.&nbsp;1746. Nasledovali &#271;alšie 
      a&nbsp;&#271;alšie. Ve&#318;mi presné tabu&#318;ky zostrojil <A 
      href="http://en.wikipedia.org/wiki/Charles-Eugène_Delaunay" 
      target=_blank>Ch.&nbsp;E.&nbsp;Delaunay</A> v&nbsp;r.&nbsp;1860. K &#271;alším 
      ve&#318;kým výpo&#269;tom Babbageovej doby patrilo ur&#269;enie dráhy a&nbsp;ve&#318;kosti 
      planéty <A href="http://en.wikipedia.org/wiki/Neptune" 
      target=_blank>Neptún</A> v&nbsp;r. 1845, ktorá bola objavená 
      v&nbsp;r.&nbsp;1846.</P>
      <P>V Babbageovej dobe mali tabu&#318;ky, &#269;i už matematických funkcií alebo 
      nameraných údajov, ohromný význam. Boli jedným z&nbsp;hlavných 
      prostriedkov, ktorými vedci zaznamenávali svoje poznatky a&nbsp;skúsenosti 
      tak, aby z&nbsp;nich &#271;alší mali úžitok. Babbage vydal logaritmické tabu&#318;ky 
      ("preložené" aj do ma&#271;ar&#269;iny) a&nbsp;jeho hlavným životným cie&#318;om sa stalo 
      vytvori&#357; stroj, ktorý by u&#318;ah&#269;il a&nbsp;spresnil výpo&#269;ty (logaritmických) 
      tabuliek, v&nbsp;ktorých bývalo vždy ve&#318;a chýb.</P>
      <P>Prvým cie&#318;om Babbageho bolo zostroji&#357; stroj, tzv. <A 
      href="http://en.wikipedia.org/wiki/Difference_Engine" 
      target=_blank>Difference Engine</A>, ktorý by diferen&#269;nou metódou 
      vypo&#269;ítaval hodnoty polynómov a&nbsp;tla&#269;il príslušné tabu&#318;ky. (V&nbsp;tom 
      &#269;ase už bol známy <A href="http://en.wikipedia.org/wiki/Karl_Weierstrass" 
      target=_blank>Weierstrassov</A> <A 
      href="http://en.wikipedia.org/wiki/Stone-Weierstrass_theorem" 
      target=_blank>výsledok</A>, že každú spojitú funkciu možno 
      s&nbsp;&#318;ubovo&#318;nou presnos&#357;ou aproximova&#357; polynómom.) Všimnime si, že 
      podobne ako&nbsp;u&nbsp;Gutenberga, Babbageovym cie&#318;om nebolo nahrali&#357; 
      vtedajších výpo&#269;tárov, ale len urýchli&#357; a&nbsp;skvalitni&#357; výrobu ich 
      pomôcok – tabuliek.</P>
      <P>V roku 1822 Babbage zostrojil zjednodušený prototyp, ktorý 
      umož&#328;oval&nbsp; tabulova&#357; polynómy druhého stup&#328;a s&nbsp;celo&#269;íselnými 
      koeficientmi, úspešne ho demonštroval a&nbsp;získal podporu vlády 
      (postupne až do 17 000 £), ktorá verila vo využitie stroja pre 
      námorníctvo, a&nbsp;pustil sa do stavby kompletného stroja, ktorý mal 
      umožni&#357; tabulovanie polynómov šiesteho stup&#328;a a&nbsp;tla&#269; tabuliek na 
      papier (resp. kreslenie grafov vypo&#269;ítavaných funkcií).</P>
      <P>Babbageov projekt, ktorý bol rádovo zložitejší než &#269;oko&#318;vek do tej doby 
      zostrojené, skon&#269;il neúspešne&nbsp;–&nbsp;oficiálne pre nedostatok 
      financií, v&nbsp;r.&nbsp;1333. Malo to však ešte &#271;alšie tri prí&#269;iny. Prvou 
      bola technológia. Hoci pracoval so špi&#269;kovými majstrami, s&nbsp;vtedajšou 
      technológiou bolo prakticky nemožné docieli&#357; stabilitu stroja, zaisti&#357; 
      požadovanú presnos&#357; a&nbsp;synchronizáciu obrovského po&#269;tu tak 
      primitívnych elementov, akými boli ozubené kolesá. Druhou bol Babbage. 
      Pracoval nesystematicky, neustále menil plány, &#357;ažko sa s&nbsp;nim 
      spolupracovalo. Tre&#357;ou bol samotný "Difference Engine", jeho malá 
      rýchlos&#357;, ktorá nemohla zrevolucionizova&#357; vtedajšie výpo&#269;ty.</P>
      <P>M. Moseley píše: "<SPAN style="FONT-STYLE: italic">A few trials had 
      been made to show the rapidity with which it (prototyp!) could calculate. 
      The first was a&nbsp;table from formula x</SPAN><SUP 
      style="FONT-STYLE: italic">2</SUP> - x - 41. In the earlier numbers it was 
      possible, writing quickly, to keep up with the engine, but when four 
      figures were required the machine was at least equal in speed to the 
      writer...“</P>
      <P>Babbageov projekt inšpiroval švédskeho právnika, redaktora, 
      a&nbsp;prekladate&#318;a (<A 
      href="http://en.wikipedia.org/wiki/Giovanni_Boccaccio" 
      target=_blank>Boccacia</A>, <A 
      href="http://en.wikipedia.org/wiki/Walter_Scott" target=_blank>Scotta</A> 
      a&nbsp;<A href="http://en.wikipedia.org/wiki/William_Shakespeare" 
      target=_blank>Shakespeara</A>) <A 
      href="http://en.wikipedia.org/wiki/Per_Georg_Scheutz" target=_blank>Georga 
      Scheutza</A> a&nbsp;jeho syna, ktorí v&nbsp;r.&nbsp;1854 zostrojili, za 
      podpory švédskej akadémie, modifikáciu Difference Engine, pre tabulovanie 
      polynómu štvrtého stup&#328;a, a&nbsp;vystavovali ju, za pomoci Babbagea, aj 
      v&nbsp;Londýne. Stroj potom zakúpilo <A 
      href="http://en.wikipedia.org/wiki/Dudley_Observatory" 
      target=_blank>Dudley Observatory</A> v&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Albany,_New_York" 
      target=_blank>Albany</A> (USA).</P>
      <P><BR>Keby bol Babbage býval "rozumný muž" (alebo mal aspo&#328; rozumnú 
      manželku) bol by sa z&nbsp;neúspechu pou&#269;il a&nbsp;uvedomil si, že príliš 
      predbieha dobu. Jeho geniálny duch však reagoval, na š&#357;astie potomkov, 
      pravé opa&#269;ne. Babbage sa pustil do ešte ambicióznejšieho projektu, ktorým 
      predbehol dobu aspo&#328; o&nbsp;100 rokov a&nbsp;stal sa praotcom 
      po&#269;íta&#269;ov.</P>
      <DIV class=img_divr><IMG title="Scheutzov stroj" 
      style="WIDTH: 300px; HEIGHT: 225px" alt="Scheutzov stroj" 
      src="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/scheutz.jpg"><BR>Scheutzov 
      stroj <A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#zdroje">[6]</A></DIV>
      <P>Na novom projekte&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Analytical_Engine" 
      target=_blank>Analytical Engine</A> za&#269;al pracova&#357; už po&#269;as "dokon&#269;ovania" 
      Difference Engine a&nbsp;v&nbsp;r.&nbsp;1837 sa v&nbsp;podstate 
      dopracoval&nbsp;k&nbsp;myšlienke univerzálneho &#269;íslicového po&#269;íta&#269;a, ktorý 
      mal obsahova&#357; vstup a&nbsp;výstup (na diernych štítkoch), pamä&#357; 
      (v&nbsp;ktorej malo by&#357; 50 riadkov po 100 ozubených kolies), aritmetickú 
      jednotku (nazývanú "mill" a&nbsp;vytvorenú z ozubených koliesok 
      a&nbsp;prevodov). Riadenie výpo&#269;tov malo by&#357; prostredníctvom diernych 
      štítkov. Analytical Engine mal spracováva&#357; programy zostavené zo štítkov 
      pre premenné, štítkov pre operácie a&nbsp;špeciálnych "indexových" 
      a&nbsp;"kombinatorických" štítkov pre riadenie cyklov. Babbage strávil 
      ve&#318;a &#269;asu vylepšovaním svojho "mlynu" a&nbsp;na efektívnu realizáciu 
      aritmetických operácií (+,-,*,/). Uvažoval aj o&nbsp;dvojnásobnej 
      aritmetike. Analytical Engine mal by&#357; na ru&#269;ný pohon, aj ke&#271; Babbage 
      uvažoval o&nbsp;parnom pohone.</P>
      <DIV class=img_divr><IMG title="Babbageov mill zostrojený jeho synom" 
      style="WIDTH: 220px; HEIGHT: 243px" 
      alt="Babbageov mill zostrojený jeho synom" 
      src="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/babbage_mill.jpg"><BR>Babbageov 
      mill zostrojený jeho synom <A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#zdroje">[7]</A></DIV>
      <P>Babbageove názory na Analytical Engine sa neustále vyvíjali. 
      V&nbsp;podstate vytvoril, v&nbsp;zámeroch, celú sériu stále dokonalejších 
      Analytical Engines. Významný je &#269;lánok, ktorý na základe Babbageovho 
      výkladu a&nbsp;nákresov, napísal taliansky inžinier <A 
      href="http://en.wikipedia.org/wiki/Federico_Luigi,_Conte_Menabrea" 
      target=_blank>L. F. Manebrea</A>. Tento &#269;lánok preložila a&nbsp;doplnila 
      významnými poznámkami jeho priate&#318;ka krásna a&nbsp;múdra (aj ako 
      matemati&#269;ka vychovávaná de Morganom) a&nbsp;nezávislá <A 
      href="http://en.wikipedia.org/wiki/Ada_Lovelace" target=_blank>Augusta 
      Ada</A>, dcéra&nbsp;<A 
      href="http://en.wikipedia.org/wiki/George_Byron,_6th_Baron_Byron" 
      target=_blank>Lorda Byrona</A>, neskoršie lady Lovelace. Adine poznámky, 
      dvakrát tak dlhé ako Manebreaov &#269;lánok, sa rodili v&nbsp;zložitej 
      spolupráci s&nbsp;Babageom. Z&nbsp;Adinho listu Babbageovi "<SPAN 
      style="FONT-STYLE: italic">I am much annoyed at your having altered my 
      Note. You know, I am always willing to make any required alterations 
      myself, but that I cannot endure another person to meddle with my 
      sentence....</SPAN>" (Poznámky sa týkali hlavne principiálnych možností 
      a&nbsp;ohrani&#269;ení navrhovaného stroja. Ada však preh&#318;ad doplnila aj 
      programom na výpo&#269;et <A 
      href="http://en.wikipedia.org/wiki/Jakob_Bernoulli" 
      target=_blank>Bernoulliho</A>&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Bernoulli_number" 
      target=_blank>&#269;ísiel</A>.) Po&#269;as tejto spolupráce si obaja uvedomili 
      potrebu podmienených príkazov pre realizáciu cyklov. Adine poznámky 
      ukazujú, ako fantasticky predbehli dobu tak Babbage, ako aj Ada, ktorá 
      napríklad napísala (&#269;o je asi prvé hodnotenie inteligen&#269;ných schopností 
      po&#269;íta&#269;ov):</P>
      <P>"<SPAN style="FONT-STYLE: italic">The Analytical Engine has no 
      pretensions whatever to originate anything. It can do whatever we know to 
      order it to perform. It can follow analysis, but it has no power of 
      anticipating any analytical relations or truths. Its provence is to assist 
      us in making available what we are already acguinted with.</SPAN>"</P>
      <P>Babbage považoval Analytical Engine za stroj na zostrojovanie tabuliek, 
      ale uvedomoval si jeho &#271;alekosiahle možnosti, napríklad "<SPAN 
      style="FONT-STYLE: italic">rieši&#357; &#318;ubovo&#318;nú algebrickú rovnicu</SPAN>" 
      a&nbsp;dokonca "<SPAN style="FONT-STYLE: italic">pripravova&#357; 
      (a&nbsp;dierova&#357;) vlastné programy</SPAN>". Napísal: "<SPAN 
      style="FONT-STYLE: italic">Analytical Engine sp&#314;&#328;a podmienky, ktoré 
      umož&#328;ujú kone&#269;nému stroju vykonáva&#357; neohrani&#269;ené výpo&#269;ty</SPAN>". Nedá sa 
      však poveda&#357;, že by Babbage mal úplne jasnú predstavu programu 
      s&nbsp;cyklami alebo, že by si uvedomoval tak jasne univerzálnos&#357; 
      navrhovaného stroja, ako to urobil o&nbsp;100 rokov neskoršie jeho krajan 
      A. Turing.</P>
      <P>Návrh na zostrojenie Analytical Engine predložil Babbage vláde. Vládna 
      komisia návrh ve&#318;mi priaznivo posúdila, vyjadrila len svoju neschopnos&#357; 
      odhadnú&#357; spo&#318;ahlivos&#357; a&nbsp;cenu navrhovaného stroja a&nbsp;konštatovala: 
      "<SPAN style="FONT-STYLE: italic">We do not consider that the 
      possibilities of its misuse are any serious drawback to its use or 
      value</SPAN>" &#269;o je asi prvý oficiálny názor na dnes bežnú otázku, &#269;i 
      po&#269;íta&#269;e nepredstavujú nebezpe&#269;enstvo pre &#318;udskú spolo&#269;nos&#357;.</P>
      <P>Zostrojená &#269;as&#357; "Difference Engine" je v&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Science_Museum_(London)" 
      target=_blank>Science Museum</A> v <A 
      href="http://en.wikipedia.org/wiki/South_Kensington" target=_blank>South 
      Kensingtone</A> (Londýn). Babbage upadol na dlhú dobu do zabudnutia 
      a&nbsp;nenašlo sa pre neho miesto ani v&nbsp;štvorzväzkovom "Príru&#269;ním 
      slovníku náu&#269;ním", vydanom &#268;SAV v&nbsp;roku 1962.</P>
      <P>Analytical Engine inšpiroval &#271;alších. Na jeho návrhu pracoval škótsky 
      ú&#269;tovník <A href="http://en.wikipedia.org/wiki/Percy_Ludgate" 
      target=_blank>P.&nbsp;E.&nbsp;Ludgate</A> (1883&nbsp;–&nbsp;1922), ktorý 
      už mal jasnú predstavu programu ako postupnosti štvoradresových inštrukcií 
      na diernej páske. &#270;alej úspešný tvorca automatov, prezident španielskej 
      akadémie vied, <A 
      href="http://en.wikipedia.org/wiki/Leonardo_Torres_y_Quevedo" 
      target=_blank>L.&nbsp;Torres</A> (1852&nbsp;–&nbsp;1936), ktorý už 
      rozpracoval schému pre podmienený príkaz, uvedomoval si možnos&#357; zostroji&#357; 
      elektromechanickú verziu Analytical Engine a&nbsp;asi by bol býval projekt 
      dotiahol do konca, keby v&nbsp;prostredí, v&nbsp;ktorom žil, bola bývala 
      dostato&#269;ná potreba pre univerzálny po&#269;íta&#269;. Torres ale zostrojil prvý plne 
      automatický automat (<A href="http://en.wikipedia.org/wiki/El_Ajedrecista" 
      target=_blank>El Ajedrecista</A>), aj s&nbsp;mechanickou rukou na 
      premiest&#328;ovanie figúr, na šachovu koncovku krá&#318; a&nbsp;s&nbsp;vežou proti 
      krá&#318;ovi. Nasledujúci citát zo <A 
      href="http://en.wikipedia.org/wiki/Scientific_American" 
      target=_blank>Scientific American</A> (1915) o&nbsp;tomto automate je asi 
      jedným z&nbsp;prvých zamyslení sa o&nbsp;možnostiach umelej inteligencie: 
      "<SPAN style="FONT-STYLE: italic">There is no claim that (the chess 
      player) will think or accomplish things where trought is necessary, but 
      its inventor claims that the limits within which thought is really 
      necessary need to be better defined and that automaton can do many things 
      that are populary classed with thought</SPAN>".</P>
      <P>Je zaujímavé, že poprední fyzici 19. storo&#269;ia sa neinšpirovali 
      Babbageovými ideami, ale obrátili svoju pozornos&#357; na konštrukciu podstatne 
      rýchlejších, aj ke&#271; jednoú&#269;elových, analógových strojov na základe 
      vtedajšej technológie. Patrí sem Maxwellov integrátor (1855) a&nbsp;<A 
      href="http://zapatopi.net/kelvin/papers/harmonic_analyzer.html" 
      target=_blank>Kelvinov harmonický analyzátor</A>, ktorý bol prvým strojom 
      (na výpo&#269;et <A 
      href="http://en.wikipedia.org/wiki/Fourier_series#Modern_derivation_of_the_Fourier_coefficients" 
      target=_blank>Fourierovych koeficientov</A>), ktorý ve&#318;mi výrazne 
      urých&#318;oval výpo&#269;ty (neskoršie vylepšený <A 
      href="http://en.wikipedia.org/wiki/Albert_Abraham_Michelson" 
      target=_blank>Michelsonom</A> a&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Addams_Stratton_McAllister" 
      target=_blank>Strattonom</A>) a&nbsp;tiež Kelvinove a&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Vannevar_Bush" 
      target=_blank>Bushove</A> <A 
      href="http://en.wikipedia.org/wiki/Differential_analyser" 
      target=_blank>diferenciálne analyzátory</A> (1876&nbsp;a&nbsp;1930).</P>
      <P>Z praktického h&#318;adiska ve&#318;mi významným prínosom bol diernoštítkový 
      stroj, ktorý zostrojil <A 
      href="http://en.wikipedia.org/wiki/Herman_Hollerith" target=_blank>Herman 
      Hollerith</A> (1860&nbsp;–&nbsp;1929) v&nbsp;roku 1888. Jeho vznik je 
      typickým prípadom, že postavenie ve&#318;kých cie&#318;ov mobilizuje &#318;udstvo 
      a&nbsp;prináša &#269;asto prekvapujúce riešenia s&nbsp;dopadom podstatne 
      prevyšujúcim pôvodný ciel.</P>
      <P>Kongres USA rozhodol, že po&#269;núc rokom 1830 bude štatistický úrad 
      vykonáva&#357; každých 10 rokov s&#269;ítanie &#318;udu. &#268;oskoro sa ukázalo, že je to 
      úloha presahujúca hranice vtedajšej technológie spracovania informácie. 
      Ani v&nbsp;roku 1887 neboli ešte spracované výsledky s&#269;ítania &#318;udu 
      z&nbsp;roku 1880. Bolo zrejmé, že existujúcou technikou by bolo s&#269;ítanie 
      plánované na rok 1890 nezvládnute&#318;né. Rozhodli sa vypísa&#357; sú&#357;až. Do 
      posledného kola sa dostali tri návrhy. V&nbsp;skúšobnej prevádzke na 10 
      000 &#318;u&#271;och sa ukázal <A 
      href="http://en.wikipedia.org/wiki/Tabulating_machine" 
      target=_blank>Hollerithov stroj</A> devä&#357; násobne rýchlejší ako &#271;alšie dva 
      systémy. Pomocou diernoštítkového stroja boli výsledky s&#269;ítania &#318;udu 
      v&nbsp;USA v&nbsp;r.&nbsp;1890 spracované za 6 týžd&#328;ov s&nbsp;výsledkom 62 
      622 250. Diernoštítkové stroje objednala pre s&#269;ítanie &#318;udu 
      v&nbsp;r.&nbsp;1897 aj cárska vláda.</P>
      <P>&#356;ažkosti s&nbsp;censusom (s&#269;ítaním&nbsp; &#318;udu) v&nbsp;r.&nbsp;1890 
      predstavujú asi prvý prípad, kedy si skupina &#318;udí uvedomila, že svet sa 
      stáva príliš zložitý a&nbsp;že presahuje schopnosti &#318;udského mozgu 
      analyzova&#357; ho bez pomoci strojov. Nie je tiež bez zaujímavosti, že sa 
      ozvali hlasy proti používaniu Hollerithových strojov pre census – tak 
      dôležité údaje vraj nemožno zveri&#357; stroju.</P>
      <P>Hollerith sa hrdo považoval za "<SPAN style="FONT-STYLE: italic">prvého 
      štatistického inžiniera</SPAN>", založil ve&#318;mi úspešnú spolo&#269;nos&#357; 
      Tabulating Machine Company. Tá sa v roku 1911 zlú&#269;ila s &#271;alšími dvomi 
      spolo&#269;nos&#357;ami a vytvorili <A 
      href="http://en.wikipedia.org/wiki/Computing_Tabulating_Recording_Corporation" 
      target=_blank>Computing Tabulating Recording Corporation</A>. Pod vedením 
      <A href="http://en.wikipedia.org/wiki/Thomas_J._Watson" 
      target=_blank>Thomasa J. Watsona</A> sa v roku 1924 spolo&#269;nos&#357; premenovala 
      na&nbsp;<A href="http://en.wikipedia.org/wiki/IBM" 
      target=_blank>International Business Machine Corporation</A> (na Kanadský 
      trh&nbsp;však s týmto názvom prišla už v roku 1917).</P>
      <P>Vznik a&nbsp;úspech diernoštítkových strojov, 50 rokov potom, &#269;o 
      Babbage dostal nápad zostroji&#357; univerzálny po&#269;íta&#269;, boli podmienené 
      zmenami, ktoré v&nbsp;priebehu 50 rohov nastali. Priemyselná revolúcia 
      mala za následok podstatné zlepšenie technológie, objavil sa nový zdroj 
      energie – elektrina, podstatne vzrástla potreba, aj nenumerických, 
      výpo&#269;tov.</P>
      <P>Diernoštítkové stroje, pôvodne ur&#269;ené pre nenumerické 
      a&nbsp;štatistické výpo&#269;ty, sa postupne za&#269;ali používa&#357; a&nbsp;adaptova&#357; 
      aj na numerické výpo&#269;ty. V&nbsp;r.&nbsp;1928 <A 
      href="http://en.wikipedia.org/wiki/Leslie_Comrie" target=_blank>L. J. 
      Comrie</A>na diernoštítkových strojoch zostavil nové tabu&#318;ky polohy 
      Mesiaca a&nbsp;v&nbsp;r.&nbsp;1937 IBM zriadila <A 
      href="http://en.wikipedia.org/wiki/Thomas_J._Watson_Research_Center" 
      target=_blank>Thomas J.&nbsp;Watson Astronomical Computing Bureau</A>.</P>
      <P>Plne fungujúce programovate&#318;né po&#269;íta&#269;e vznikli až v&nbsp;období druhej 
      svetovej vojny a&nbsp;prvý z&nbsp;nich <A 
      href="http://en.wikipedia.org/wiki/Z3" target=_blank>Z<SUB>3</SUB></A>, 
      zostrojil v&nbsp;Berlíne, v&nbsp;r. 1941, <A 
      href="http://en.wikipedia.org/wiki/Konrad_Zuse" target=_blank>Konrad 
      Zuse</A> (1910&nbsp;–&nbsp;1995), vychádzajúc zo svojho patentu 
      z&nbsp;r.&nbsp;1936.</P>
      <P>Prvé modely <A href="http://en.wikipedia.org/wiki/Z1_(computer)" 
      target=_blank>Z<SUB>1</SUB></A> a&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Z2" target=_blank>Z<SUB>2</SUB></A> 
      zostrojil Zuse na kolene, v byte rodi&#269;ov. V&nbsp;r.&nbsp;1943 dostal 
      objednávku ministerstva letectva na Z<SUB>3</SUB> a&nbsp;založil firmu, 
      zamestnávajúcu 15 mužov. Vyrobili tri Z<SUB>3</SUB>.</P>
      <P>Po&#269;íta&#269; Z<SUB>3</SUB> bol riadený programom (presnejšie lineárnym 
      aritmetickým programom – bez podmienených príkazov), ktorý sa skladal 
      z&nbsp;8&nbsp;bitových jednoadresových inštrukcií na diernej páske. 
      Aritmetická jednotka pracovala v&nbsp;binárnej sústave, v&nbsp;pohyblivej 
      rádovej &#269;iarke s&nbsp;d&#314;žkou slova 22 bitov a&nbsp;so zabudovanými 
      operáciami +,-,*,/, &#8730; a&nbsp;násobenie konštantami 2, 0.5, 10, 0.1, -1. 
      Pamä&#357; mala 64 slov, vstup bol klávesnicou, výstupom bol lampový display so 
      4&nbsp;desiatkovými ciframi a&nbsp;desatinnou bodkou. Z<SUB>3</SUB> mal 
      2600 elektromechanických relé a&nbsp;používal sa, ve&#318;mi utajovaný, pre 
      balistické výpo&#269;ty pre <A href="http://en.wikipedia.org/wiki/V-2_rocket" 
      target=_blank>V–rakety</A>.</P>
      <P>Po&#269;íta&#269;e Z<SUB>1</SUB>–Z<SUB>3</SUB> boli zni&#269;ené pri bombardovaní 
      v&nbsp;r.&nbsp;1944. Model Z<SUB>4</SUB> s&nbsp;32 bitovým slovom 
      a&nbsp;mechanickou pamä&#357;ou vyviezol Zuse v&nbsp;r.&nbsp;1945 do 
      Švaj&#269;iarska a&nbsp;používali ho na <A 
      href="http://en.wikipedia.org/wiki/ETH_Zurich" target=_blank>ETH 
      v&nbsp;Zürichu</A> (1950 – 1955).</P>
      <P>Zuse bol priekopníkom v&nbsp;po&#269;íta&#269;ovej architektúre aj 
      v&nbsp;programovacích jazykoch. Rozpracoval metódu popisu logiky po&#269;íta&#269;a, 
      &#269;o mu umožnilo &#318;ahko meni&#357; sú&#269;iastkovú bázu. Modely Z<SUB>1</SUB> a 
      Z<SUB>2</SUB> mali mechanické prepína&#269;e a&nbsp;pamä&#357;. V&nbsp;r.&nbsp;1945 
      rozpracoval programovací jazyk <A 
      href="http://en.wikipedia.org/wiki/Plankalkül" 
      target=_blank>Plankalkül</A> s&nbsp;viacrozmernými po&#318;ami, prira&#271;ovacími, 
      podmienenými a&nbsp;iteratívnymi príkazmi a&nbsp;procedúrami, ktorý 
      ovplyvnil konštrukciu jazyka <A 
      href="http://en.wikipedia.org/wiki/ALGOL_58" target=_blank>ALGOL 58</A> 
      a&nbsp;jeden z&nbsp;prvých kompilátorov pre ALGOL&nbsp;58 zostrojil 
      M.&nbsp;Paul pre Zuseho Z<SUB>22</SUB>.</P>
      <P>Blízkym spolupracovníkom Zuseho bol H.&nbsp;T.&nbsp;Schreyer, ktorý 
      získal v&nbsp;r.&nbsp;1938 doktorát za prácu, v&nbsp;ktorej ukázal, že na 
      elektrónkach je možné postavi&#357; super rýchly po&#269;íta&#269;. Zuse sa použitia 
      elektróniek, pre ich cenu a&nbsp;nespo&#318;ahlivos&#357;, vzdal. Spolu so 
      Schreyerom však (v&nbsp;r.&nbsp;1940) navrhli projekt super rýchleho 
      jednoú&#269;elového po&#269;íta&#269;a pre dekódovanie správ, ktorý by pracoval na 
      elektrónkach. Projekt bol zamietnutý. Jeho realizácia mala trva&#357; viac než 
      rok a&nbsp;v&nbsp;tom &#269;ase <A 
      href="http://en.wikipedia.org/wiki/Adolf_Hitler" target=_blank>Hitler</A>, 
      si istý bleskovým ví&#357;azstvom, nedával priestor dlhodobejším, na vojenské 
      ú&#269;ely zameraným, projektom.</P>
      <P>Na druhej strane britská vláda, neschopná priamo vojensky &#269;eli&#357; 
      nemeckej armáde, videla šancu v&nbsp;prelstení nepriate&#318;a a&nbsp;vytvorila 
      team z&nbsp;mladých elektrotechnikov a&nbsp;(geniálnych) 
      matematikov–šachistov. Tento tzv. <A 
      href="http://en.wikipedia.org/wiki/Bletchley_Park" 
      target=_blank>Bletchley</A> team pracoval v&nbsp;izolácii a&nbsp;ve&#318;kej 
      tajnosti a&nbsp;zostrojil v&nbsp;r.&nbsp;1943 prvý elektronický 
      (kryptografický) po&#269;íta&#269; <A 
      href="http://en.wikipedia.org/wiki/Colossus_computer" 
      target=_blank>Colossus</A>, na dekódovanie správ, v&nbsp;ktorom sa všetky 
      výpo&#269;ty robili na 2000 elektrónkach. Colossus vraj významne prispel k 
      úspechu mnohých vojenských operácií západných spojencov. Jedným 
      z&nbsp;&#269;lenov teamu bol A. Turing.</P>
      <P>Zuse nepoznal Babbageove práce. Inšpiroval sa však nimi 
      v&nbsp;r.&nbsp;1936 <A href="http://en.wikipedia.org/wiki/Howard_Aiken" 
      target=_blank>Howard H.&nbsp;Aiken</A> (1900&nbsp;–&nbsp;1973), fyzik 
      z&nbsp;Harvardu. Pre svoj návrh po&#269;íta&#269;a získal <A 
      href="http://en.wikipedia.org/wiki/Thomas_J._Watson" 
      target=_blank>T.&nbsp;J.&nbsp;Watsona</A>, vtedajšieho šéfa IBM, ktorý 
      návrh podporil finan&#269;ne (milión dolárov) aj spolupracovníkmi – &#269;o urobila 
      aj armáda – a&nbsp;tak Aiken zostrojil elektromagnetický 
      po&#269;íta&#269;&nbsp;–&nbsp;monštrum&nbsp;–&nbsp;15&nbsp;m 
      dlhý&nbsp;&nbsp;&nbsp;nazývaný stru&#269;ne <A 
      href="http://en.wikipedia.org/wiki/Harvard_Mark_I" target=_blank>Harvard 
      Mark I</A>. (Prvá verzia, zostrojená v&nbsp;laboratóriách IBM v januári 
      1943 nemala podmienený príkaz – zdá sa, že Aiken nepoznal Adine idey. 
      Druhá verzia, ukon&#269;ená v&nbsp;roku 1944 v&nbsp;Harvarde už podmienený 
      príkaz mala.)</P>
      <P>Mark I mal 72 registrov na zapamätanie 23 ciferných &#269;ísiel a&nbsp;60 
      registrov pre manuálne uloženie konštánt. Násobenie trvalo 
      asi&nbsp;6&nbsp;sekúnd a&nbsp;po&#269;íta&#269; bol riadený inštrukciami na diernej 
      páske. <A href="http://en.wikipedia.org/wiki/Harvard_Mark_II" 
      target=_blank>Mark II</A> už vykonal násobenie za 0.75 s. Hlavným prínosom 
      celého projektu sa nakoniec ukázalo zapojenie IBM do výroby po&#269;íta&#269;ov.</P>
      <P>Aikenova motivácia vychádzala z&nbsp;potrieb vedy. Vo svojej dizertácii 
      narazil na oby&#269;ajné diferenciálne rovnice, ktoré sa dali rieši&#357; len 
      zložitými výpo&#269;tami. Na druhej strane vyložene vojenské potreby boli za 
      projektom <A href="http://en.wikipedia.org/wiki/ENIAC" 
      target=_blank>ENIAC</A> (Electronic Numerical Integrator And Computer), 
      ktorý v <A 
      href="http://en.wikipedia.org/wiki/Ballistics_Research_Laboratory" 
      target=_blank>Ballistic Research Laboraty</A> v&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Moore_School_of_Electrical_Engineering" 
      target=_blank>Moore School of Electrical Engineering</A> na <A 
      href="http://en.wikipedia.org/wiki/University_of_Pennsylvania" 
      target=_blank>univerzite v&nbsp;Pennsylvánii</A> v&nbsp;júni 1943 za&#269;ali 
      <A href="http://en.wikipedia.org/wiki/John_Mauchly" target=_blank>J. W. 
      Mauchly</A> a&nbsp;<A 
      href="http://en.wikipedia.org/wiki/J._Presper_Eckert">J.&nbsp;P. 
      Eckert</A>. Po intenzívnej práci, vo ve&#318;kej tajnosti, prvý univerzálny 
      elektronický po&#269;íta&#269; ENIAC bol daný do prevádzky (vo februári 1946). 
      Pracoval s&nbsp;&#269;íslami v&nbsp;desiatkovej sústave. Mal 20 akumulátorov 
      (pre s&#269;ítanie a&nbsp;od&#269;ítanie) a&nbsp;ru&#269;ne nastavovanú pamä&#357; pre 312 
      "tabu&#318;kových hodnôt". Vstup a&nbsp;výstup bol na diernych štítkoch 
      (zostavený v&nbsp;spolupráci s&nbsp;IBM). Mal 18000 elektróniek 
      (chladených prúdom vzduchu z vrtulí dvoch leteckých motorov), 70 000 
      odporov, 10 000 kondenzátorov, bol 30 m dlhý, 3&nbsp;m&nbsp;vysoký 
      a&nbsp;široký, vážil 30 ton, spotreboval 140 kW. Bol neuverite&#318;ne rýchly – 
      5 000 s&#269;ítaní za sekundu, násobenie bolo 14 krát, delenie 143 krát 
      pomalšie. Bol to prvý elektronický po&#269;íta&#269; na spracovanie informácie..</P>
      <P>Ballistic Research Laboratory malo v&nbsp;r.&nbsp;1944 200 
      zamestnancov, 176 reléových, jednoú&#269;elových "balistických po&#269;íta&#269;ov", 10 
      diferenciálnych analyzátorov, 14 integrátorov a&nbsp;rad diernoštítkových 
      strojov. Hlavnou úlohou bolo po&#269;íta&#357; "firing and bombing tables". 
      Konštrukcia jednej tabu&#318;ky, pri dvojsmennej prevádzke, trvala tri mesiace. 
      V&nbsp;r.&nbsp;1944 laboratórium dostávalo denne 
      v&nbsp;priemere&nbsp;6&nbsp;požiadaviek na nové tabu&#318;ky. Konštrukcia 
      ENIACu bola príliš odvážnym a&nbsp;priekopníckym &#269;inom a&nbsp;niet preto 
      divu, že prebehla, najmä ku koncu, v&nbsp;napätej atmosfére. Riskantnos&#357; 
      projektu si autori uvedomovali 
      a&nbsp;v&nbsp;žiadosti&nbsp;o&nbsp;schválenie projektu sa píše: ".<SPAN 
      style="FONT-STYLE: italic">..This is a&nbsp;development project and there 
      is no certainty that the desired result can be achivied It is, however, 
      a&nbsp;reasonable chance</SPAN>". Podstatou &#357;ažkosti bola skuto&#269;nos&#357;, že k 
      tomu, aby ENIAC mohol pracova&#357; 12 hodín bez poruchy bolo potrebné, aby 
      pravdepodobnosti zlyhania elektrónky bola 10<SUP>-14</SUP>, &#269;o bola 
      bezprecedentná požiadavka. (Už v&nbsp;decembri 1945 mal ENIAC za sebou 120 
      hodín bez poruchy!) Z&nbsp;toho dôvodu odborníci v&nbsp;elektrotechnike na 
      univerzite považovali projekt za nereálny.) Termín na konštrukciu bol 
      príliš krátky (v&nbsp;septembri 1945 boli stanovené pracovné hodiny cez 
      týžde&#328; na ENIACu od 8:00 do 24:30). Projekt vyžadoval viac pe&#328;azí než sa 
      predpokladalo (105 000 $)&nbsp; &#269;o znervóz&#328;ovalo vedenie univerzity. 
      V&nbsp;období ukon&#269;ovania prác na ENIACu už bolo jasné, že je možné 
      zostroji&#357; &#271;aleko lepší po&#269;íta&#269;. Vo ve&#318;mi pracovnej atmosfére vznikol celý 
      rad významných nápadov, nebol však &#269;as ich spísa&#357;, a&nbsp;tak vznikli 
      spory oh&#318;adom patentových práv. Nakoniec toho mal každý dos&#357;, aj 
      univerzita aj konštruktéri. Odovzdanie ENIACu prebehlo s&nbsp;ve&#318;kou 
      slávou, ale žiadnemu z&nbsp;konštruktérov neponúkla univerzita profesúru. 
      Team sa rozpadol.</P>
      <P>Ve&#318;kým nedostatkom ENIACu bolo ve&#318;mi zložité programovanie, ktoré 
      v&nbsp;podstate spo&#269;ívalo v&nbsp;"predrôtovaní". ENIAC bol pritom 
      paralelný po&#269;íta&#269;, každý register mal vlastné riadenie, ktorá bolo treba 
      zosynchronizova&#357;, na riadenie cyklov bola špeciálna jednotka tzv. "Master 
      Programmer", pamä&#357; bola minimálna, po ukon&#269;ení medzivýpo&#269;tov bolo treba 
      "predrôtova&#357;". Hlavnými programátormi boli <A 
      href="http://en.wikipedia.org/wiki/Adele_Goldstine" target=_blank>Adela 
      Goldstine</A> (ktorá napísala prvý manuál) a&nbsp;jej manžel <A 
      href="http://en.wikipedia.org/wiki/Herman_Heine_Goldstine" 
      target=_blank>H.&nbsp;H.&nbsp;Goldstine</A>. Vedúcim programátorského 
      teamu šiestich žien, (vä&#269;šinou manželiek mužov z&nbsp;ENIACovho teamu) bol 
      J. V. Holberton. Prvý ve&#318;ký problém pre <A 
      href="http://en.wikipedia.org/wiki/Los_Alamos,_New_Mexico" 
      target=_blank>Los Alamos</A> (zdá sa, že pre <A 
      href="http://en.wikipedia.org/wiki/Edward_Teller" 
      target=_blank>E.&nbsp;Tellera</A>) sa po&#269;ítal už v&nbsp;decembri 1945.</P>
      <P>Nedostatok centrálneho riadenia v&nbsp;ENIACu odstránili 
      v&nbsp;r.&nbsp;1947, ke&#271; ENIAC prerobili na akýsi jednoduchý po&#269;íta&#269; so 
      zapamätanými programami. Zvä&#269;šilo to rýchlos&#357; ENIACu ale podstatne 
      u&#318;ah&#269;ilo programovanie. V&nbsp;podstate to bol akýsi prvý "opera&#269;ný 
      systém". Bola to idea J. von Neumanna.</P>
      <P>H. Goldstine ktorý bol jeden z&nbsp;vedúcich ENIACovho teamu, sa 
      v&nbsp;lete 1944, &#269;akajúc na vlak na stanici v&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Aberdeen,_Maryland" 
      target=_blank>Aberderne</A>, náhodou stretol s&nbsp;Johnom von Neumannom, 
      jedným z&nbsp;matematikov 20, storo&#269;ia. Von Neumann, ktorý vtedy 
      spolupracoval na <A href="http://en.wikipedia.org/wiki/Nuclear_weapon" 
      target=_blank>atómovej bombe</A> a&nbsp;zaujímal sa o&nbsp;projekt 
      vodíkovej&nbsp; bomby, silne postrádal po&#269;íta&#269; na riešenie parciálnych 
      diferenciálnych rovníc. Bol tak nadšený o&#269;akávanou rýchlos&#357;ou ENIACu, že 
      hne&#271; za&#269;al spolupracova&#357;, ako konzultant s&nbsp;ENIAC–ovým teamom 
      a&nbsp;stal sa vedúcou postavou v&nbsp;diskusiách, z&nbsp;ktorých vznikla 
      predstava nového po&#269;íta&#269;a, nazývaného <A 
      href="http://en.wikipedia.org/wiki/EDVAC" target=_blank>EDVAC</A> 
      (Electronic Discrete Variable Automatic Computer), so zapamätaným 
      programom a&nbsp;s&nbsp;pamä&#357;ou na oneskorovacích linkách (to bola 
      Eckertova idea, ktorá umožnila 100 násobne zredukova&#357; po&#269;et elektróniek 
      pre pamä&#357;. Je zaujímavé, že A. Turing, ktorý v&nbsp;r. 1947 von Neumanna 
      navštívil, sa mu pokúšal dokáza&#357;, že taká pamä&#357; nemôže spo&#318;ahlivo 
      fungova&#357;). Do príchodu von Neumanna sa ENIAC–ov team sústre&#271;oval na 
      technologické problémy. Von Neumann, inšpirovaný prácou <A 
      href="http://en.wikipedia.org/wiki/Warren_Sturgis_McCulloch" 
      target=_blank>W.&nbsp;S.&nbsp;McCullocha</A> a&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Walter_Pitts" 
      target=_blank>W.&nbsp;Pittsa</A> o modelovaní neurónových sieti, obrátil 
      pozornos&#357; ENIACovho teamu na problémy logického návrhu po&#269;íta&#269;a. Výsledkom 
      diskusie bola správa "<A 
      href="http://en.wikipedia.org/wiki/First_Draft_of_a_Report_on_the_EDVAC" 
      target=_blank>First draft of a&nbsp;report on the EDVAC</A>" napísaná von 
      Neumannom (30. 6. 1945), v&nbsp;ktorej sa jasne poukazuje na:<BR></P>
      <UL>
        <LI>potrebu používa&#357; binárnu aritmetiku 
        <LI>potrebu sekven&#269;ného spracovania inštrukcií 
        <LI>potrebu ve&#318;kej pamäte ako pre &#269;ísla, tak aj pre inštrukcie. </LI></UL>
      <P>Táto správa, pôvodne v&nbsp;24 kópiách, sa &#269;oskoro stala známa po celom 
      svete a&nbsp;za&#269;ala modernú éru po&#269;íta&#269;ov ako systémov na pamätanie 
      a&nbsp;spracovanie informácie.</P>
      <DIV class=img_divl><IMG title="John von Neumann" 
      style="WIDTH: 222px; HEIGHT: 262px" alt="John von Neumann" 
      src="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/john_von_neumann.jpg"><BR>John 
      von Neumann <A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#zdroje">[8]</A></DIV>
      <P><A href="http://en.wikipedia.org/wiki/John_von_Neumann" 
      target=_blank>John von Neumann</A> (1903&nbsp;–&nbsp;1957), narodený 
      v&nbsp;Budapešti, matematik a&nbsp;matematický, fyzik, bol ve&#318;kou 
      osobnos&#357;ou, ako stvorený na za&#269;atie novej éry po&#269;íta&#269;ov. Mal ohromnú pamä&#357; 
      s&nbsp;perfektne utriedenými informáciami a&nbsp;perfektný výber 
      z&nbsp;pamäte. Dokázal doslova citova&#357; knihu, ktorú &#269;ítal pred rokmi. 
      Udivoval rýchlos&#357;ou, s&nbsp;ktorou dokázal, bez papiera, vykona&#357; zložité 
      numerické výpo&#269;ty a&nbsp;slávny bol rýchlos&#357;ou, ktorou dokázal dokazova&#357;. 
      <A href="http://en.wikipedia.org/wiki/Lothar_Wolfgang_Nordheim" 
      target=_blank>L.&nbsp;W.&nbsp;Nordheim</A>, teoretický fyzik, povedal: 
      "<SPAN style="FONT-STYLE: italic">Hilbert was slow</SPAN>" ale "<SPAN 
      style="FONT-STYLE: italic">von Neumann had the fastest mind I have ever 
      seen</SPAN>". Ako šes&#357;ro&#269;ný ovládal gré&#269;tinu, z ma&#271;ar&#269;iny prekladal 
      rýchlos&#357;ou &#269;ítania, matematicky myslel v&nbsp;nem&#269;ine, udivoval ako 
      perfektný prednášajúci znalos&#357;ou angli&#269;tiny. Bol skvelý historik, vypráva&#269; 
      anekdot, známe boli jeho "vine parties" raz za týžde&#328;. Bol hrozný vodi&#269;, 
      jednu z&nbsp;križovatiek ne&#271;aleko univerzity v&nbsp;Princetone nazývali 
      jeho kolegovia von Neumannovou križovatkou. Spolupracoval s&nbsp;Hilbertom 
      na budovaní základov matematiky, s&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Robert_Oppenheimer">R.&nbsp;Oppenheimerom</A> 
      na atómovej bombe a&nbsp;skoro na všetkom medzi tým, &#269;o sa týkalo 
      matematiky a&nbsp;teoretickej fyziky. Od roku 1933 pôsobil v&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Institute_for_Advanced_Study" 
      target=_blank>Institute for Advanced Study</A> v&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Princeton,_New_Jersey" 
      target=_blank>Princetone</A>, &#269;o bolo hlavné centrum svetovej matematiky 
      a&nbsp;teoretickej fyziky s&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Thorstein_Veblen" 
      target=_blank>T.&nbsp;Veblonom</A> a&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Albert_Einstein" 
      target=_blank>A.&nbsp;Einsteinom</A> ako prvými profesormi. Za&#269;al tou 
      naj&#269;istejšou matematikou, kon&#269;il ako odborník v&nbsp;parciálnych 
      diferenciálnych rovniciach, automatoch, "shock and detonation waves", 
      hydrodynamike a&nbsp;ako riadite&#318; projektu konštrukcie prvého "von 
      Neumannovského" po&#269;íta&#269;a. Zomrel na rakovinu.</P>
      <P>&#270;alší vývoj v&nbsp;oblasti po&#269;íta&#269;ov bol rapídny. Pripomína šírenie 
      kníhtla&#269;e a&nbsp;históriu <A 
      href="http://en.wikipedia.org/wiki/Silicon_Valley" target=_blank>Silicon 
      Valley</A>. Na základe projektu EDVAC za&#269;al ako prvý pracova&#357; po&#269;íta&#269; <A 
      href="http://en.wikipedia.org/wiki/EDSAC" target=_blank>EDSAC</A> 
      (Electronic Delay Storage Automatic Calculator) v&nbsp;Cambridge 
      v&nbsp;r.&nbsp;1949 zostrojený <A 
      href="http://en.wikipedia.org/wiki/Maurice_Vincent_Wilkes">M.&nbsp;V.&nbsp;Wilkesom</A> 
      – bol teda prvý "stored program computer". Eckert a&nbsp;Mauchly založili 
      v&nbsp;októbri 1946 vlastnú spolo&#269;nos&#357;, ktorá v r.&nbsp;1950 zostrojila <A 
      href="http://en.wikipedia.org/wiki/BINAC" target=_blank>BINAC</A> (Binary 
      Automatic Computer) a&nbsp;v&nbsp;r.&nbsp;1951 dodala <A 
      href="http://en.wikipedia.org/wiki/UNIVAC_I" target=_blank>UNIVAC I</A> 
      (UNIVersal Automatic Computer I) pre <A 
      href="http://en.wikipedia.org/wiki/United_States_Census_Bureau" 
      target=_blank>Bureau of the Census</A>. A. Turing za&#269;al 
      v&nbsp;r.&nbsp;1945 práce na po&#269;íta&#269;i <A 
      href="http://en.wikipedia.org/wiki/ACE_(computer)" target=_blank>ACE</A>, 
      ktorý sa stal známy ve&#318;mi komplikovanou logikou. Turing chcel zostroji&#357; 
      rýchly po&#269;íta&#269;, &#269;o viedlo k zložitému kódovaniu. Malá verzia, tzv. <A 
      href="http://en.wikipedia.org/wiki/Pilot_ACE" target=_blank>Pilot Ace</A> 
      bola zostrojená v&nbsp;r.&nbsp;1950, celý ACE v&nbsp;r.&nbsp;1958. Vlastný 
      EDVAC bol ukon&#269;ený v&nbsp;r.&nbsp;1951.</P>
      <P>Najvýznamnejší však bol projekt po&#269;íta&#269;a <A 
      href="http://en.wikipedia.org/wiki/IAS_machine" target=_blank>IAS</A>, 
      ktorý v&nbsp;marci 1946 za&#269;al von Neumann a&nbsp;ktorý sa stal, na ve&#318;a 
      rokov modelom pre &#271;alší vývoj po&#269;íta&#269;ov. Termín von Neumannovský po&#269;íta&#269; 
      sa dnes používa ako na ozna&#269;enie po&#269;íta&#269;a IAS, tak aj všetkých &#271;alších 
      budovaných pod&#318;a jeho vzoru. Zatia&#318; &#269;o ENIAC bol paralelný po&#269;íta&#269; 
      (nieko&#318;ko aritmetických operácií prebiehalo sú&#269;asne) štvoradresový EDVAC 
      bol dokonale sériový&nbsp; po&#269;íta&#269; – v&nbsp;každom okamžiku sa vykonávala 
      najviac jedna aritmetická operácia aj to sériovo. IAS bol moderný, sériové 
      vykonávanie inštrukcií, paralelné vybavovanie jednotlivých operácií. 
      Správa "<SPAN style="FONT-STYLE: italic">Planning and coding problems for 
      an electronic computing instrument</SPAN>", ktorú za&#269;iatkom 1947 napísali 
      von Neumann a&nbsp;M.&nbsp;Goldstine, je historicky asi najvýznamnejším 
      &#269;lánkom o&nbsp;konštrukcii po&#269;íta&#269;ov. Obsahuje popis "von Neumannovského 
      po&#269;íta&#269;a", základnú analýzu problémov spojených s&nbsp;programovaním, 
      základy programovania použitím blokových schém at&#271;. (Von Neumann po&#269;ítal 
      s&nbsp;tým, že pri budovaní ve&#318;kých súborov sa budú používa&#357; magnetické 
      pásky a&nbsp;že funkcie sa budú zobrazova&#357; graficky na obrazovke.) 
      Jednoadresový IAS, vytvorený do tej doby v&nbsp;&#269;isto teoretickom ústave, 
      riadite&#318;om ktorého bol R.&nbsp;Oppenheimer, bol ukon&#269;ený v&nbsp;r. 1952. 
      Mal 2000 elektróniek, pamä&#357; 1024 40–bitových slov, násobenie za 600 &#956;s 
      a&nbsp;výber z&nbsp;pamäti za 25&#956;s. Bol vzorom pre po&#269;íta&#269; <A 
      href="http://en.wikipedia.org/wiki/IBM_701" target=_blank>IBM 701</A>, 
      ktorým za&#269;ala séria IBM po&#269;íta&#269;ov.</P>
      <P>Von Neumann bol roky chválený a&nbsp;zaslúžene, za vytvorenie modelu 
      sériového po&#269;íta&#269;a. Dnes je "hanený", ale nezaslúžene, za vytvorenie 
      modelu sériového a&nbsp;nie paralelného po&#269;íta&#269;a. Už v&nbsp;"<SPAN 
      style="FONT-STYLE: italic">First draft...</SPAN>" píše: "<SPAN 
      style="FONT-STYLE: italic">(computer) should never perform two operations 
      simultaneously... at lest not until we have become thoroughly and 
      practically familiar with the use of very high speed devices of this kind, 
      and also properly understood and started to exploit the entirely new 
      posibilities for numerical treatment of complicated problems which they 
      open up.</SPAN>"</P>
      <P>Prvé materiály o&nbsp;ENIACu boli impulzom&nbsp;k&nbsp;zostrojeniu 
      prvého sovietskeho po&#269;íta&#269;a <A 
      href="http://en.wikipedia.org/wiki/MESM#MESM" target=_blank>MESM</A> 
      (&#1052;&#1069;&#1057;&#1052;, &#1052;&#1072;&#1083;&#1072;&#1103; &#1069;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;-&#1057;&#1095;&#1077;&#1090;&#1085;&#1072;&#1103; &#1052;&#1072;&#1096;&#1080;&#1085;&#1072;, Small Electronic Calculating 
      Machine), ktorý za&#269;al zostrojova&#357; v&nbsp;r.&nbsp;1943 <A 
      href="http://en.wikipedia.org/wiki/Sergei_Alekseyevich_Lebedev" 
      target=_blank>S. A. Lebedev</A> (1902&nbsp;–&nbsp;1974), a&nbsp;ktorý bol 
      uvedený do prevádzky 25. 12. 1951. Prvý &#269;eskoslovenský (reléový 
      s&nbsp;bubnovou pamä&#357;ou) po&#269;íta&#269; <A 
      href="http://cs.wikipedia.org/wiki/D?jiny_po?íta??#SAPO" 
      target=_blank>SAPO</A> (SAmo&#269;inný PO&#269;íta&#269;) zostrojený <A 
      href="http://www.vumscomp.cz/Svoboda.html" target=_blank>A. Svobodom</A> 
      (1907 – 1980) vo VÚMS bol daný do prevádzky 25. 2. 1958 a&nbsp;vyhorel 22. 
      3. 1960. Bol to sú&#269;asne jeden z&nbsp;prvých "<A 
      href="http://en.wikipedia.org/wiki/Fault-tolerant_design" 
      target=_blank>fault–tolerant computer</A>" na svete.</P>
      <P>Prvý &#269;eskoslovenský elektronický po&#269;íta&#269; EPOS1 bol zostrojený opä&#357; vo 
      VÚMS, A. Svobodom v&nbsp;r.&nbsp;1963 (fault–tolerant, multiprogramovanie, 
      zdie&#318;anie &#269;asu).</P>
      <DIV style="TEXT-ALIGN: right"><A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#start">spa&#357; 
      na obsah</A></DIV>
      <H3><A name=2_4></A>2.4 VZNIK INFORMATIKY</H3>
      <P>Objav pozi&#269;ných &#269;íselných sústav, ako spôsobu zápisu &#269;ísiel 
      v&nbsp;logaritmickom &#269;ase a&nbsp;priestore, bol prvým ve&#318;kým skokom 
      v&nbsp;informatike a&nbsp;za&#269;iatkom vedeckej doby &#318;udstva.</P>
      <P>Primitívna forma pozi&#269;nej &#269;íselnej sústavy bola známa už starým <A 
      href="http://en.wikipedia.org/wiki/Babylonia" 
      target=_blank>Babylon&#269;anom</A>. Dôležitým prínosom pri vývoji pozi&#269;nej 
      &#269;íselnej sústavy bol "vynález" nuly (cca v&nbsp;9.&nbsp;storo&#269;í), za ktorý 
      v&#271;a&#269;íme <A href="http://en.wikipedia.org/wiki/Hindu" 
      target=_blank>Hindom</A>.</P>
      <P>Za prvých "informatikov" považuje <A 
      href="http://en.wikipedia.org/wiki/Donald_Knuth" target=_blank>D. E. 
      Knuth</A> starých Babylon&#269;anov. Hlinené tabu&#318;ky z&nbsp;obdobia <A 
      href="http://en.wikipedia.org/wiki/Hammurabi" target=_blank>Chamurappiho 
      dynastie</A> (1800&nbsp;–&nbsp;1600&nbsp;p.&nbsp;n.&nbsp;l.), sú 
      jedine&#269;ným svedectvom o&nbsp;úrovni ich algoritmického myslenia. 
      Babylonskí matematici zapisovali algoritmy (na riešenie algebrických 
      rovníc, prakticky motivovaných geometrických problémov, na výpo&#269;et úrokov 
      a&nbsp;pod.) vo forme procedúr, ktoré však nenarábali s&nbsp;premennými 
      ale s&nbsp;konkrétnymi, pre daný problém "typickými" hodnotami (v&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Sexagesimal" target=_blank>60–kovej 
      &#269;íselnej sústave</A>). Každá procedúra kon&#269;ila stereotypným explicitne 
      uvedeným konštatovaním: "Toto je procedúra".</P>
      <DIV class=img_divl><IMG title=Al-Chorezmi 
      style="WIDTH: 268px; HEIGHT: 326px" alt=Al-Chorezmi 
      src="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/al-khwarizmi.png"><BR>Al–Chorezmi 
      <A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#zdroje">[9]</A></DIV>
      <P>Prvou ve&#318;kou postavou v&nbsp;dejinách informatiky bol <A 
      href="http://en.wikipedia.org/wiki/Muhammad_ibn_M?s?_al-Khw?rizm?" 
      target=_blank>Al–Chorezmi</A> (plným menom Ab&#363; &#703;Abd All&#257;h Muhammad ibn 
      M&#363;s&#257; al-Khw&#257;rizm&#299;), matematik, ktorý žil v&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Khw?rizm" target=_blank>Chorezme</A>, 
      dnešný <A href="http://en.wikipedia.org/wiki/Uzbekistan" 
      target=_blank>Uzbekistan</A>, na prelome 8.&nbsp;a&nbsp;9.&nbsp;storo&#269;ia. 
      V&nbsp;rozsiahlej u&#269;ebnici aritmetiky (ktorá sa zachovala hlavne 
      v&nbsp;opisoch) popísal algoritmy, pre abakus, základných aritmetických 
      operácií nad &#269;íslami zapísanými v&nbsp;desiatkovej sústave. Cez túto prácu 
      sa dostala desiatková &#269;íselná sústava do arabského sveta a&nbsp;do Európy. 
      Svojou "Aritmetikou" a&nbsp;"Algebrou" ovplyvnil Al–Chorezmi rozvoj 
      európskej matematiky na nieko&#318;ko storo&#269;í.</P>
      <P>S Al–Chorezmim súvisí termín "<A 
      href="http://en.wikipedia.org/wiki/Algorithm" 
      target=_blank>algoritmus</A>". Je to skomolenina latinskej formy jeho mena 
      Al–gorizmi. V&nbsp;stredovekých matematických manuskriptoch bola totiž 
      formula "Dixit Algorizmi" (po slovensky "tak riekol Algorizmi") zárukou 
      kvality, jasnosti a&nbsp;spo&#318;ahlivosti a&nbsp;sú&#269;asne "argumentom", 
      o&nbsp;ktorom sa nedalo pochybova&#357;.</P>
      <P>Pre &#271;alšie významne objavy v&nbsp;informatike sa musíme prenies&#357;, na 
      koniec 16. a&nbsp;za&#269;iatok 17. storo&#269;ia, ke&#271; nastal prudký rozvoj 
      matematiky.</P>
      <P>Obrovský význam malo zavedenie písmen na ozna&#269;ovanie premenných 
      a&nbsp;neznámych, o&nbsp;&#269;o sa zaslúžil <A 
      href="http://en.wikipedia.org/wiki/François_Viète" target=_blank>François 
      Viète</A> (1540 – 1603) okolo roku 1580, a&nbsp;&#269;o dalo vznik algebre. 
      &#270;alším mí&#318;nikom v&nbsp;dejinách vedy bolo vytvorenie analytickej geometrie 
      v&nbsp;r.&nbsp;1637 <A href="http://en.wikipedia.org/wiki/René_Descartes" 
      target=_blank>René Descartesom</A> (1596 – 1650), ktorou spojil do jedného 
      prúdu dva paralelne sa rozvíjajúce sa matematické smery, algebru 
      z&nbsp;Indie a&nbsp;&#268;íny a&nbsp;geometriu z&nbsp;Grécka. Sú&#269;asne to bol 
      posledný ve&#318;ký krok potrebný&nbsp;k&nbsp;vytvoreniu diferenciálneho 
      a&nbsp;integrálneho po&#269;tu Newtonom a&nbsp;Leibnizom. V&nbsp;algebre, 
      analytickej geometrii a&nbsp;diferenciálno–integrálnom kalkule malo 
      vytváranie algoritmov, dostato&#269;ne všeobecných, ve&#318;ký význam.</P>
      <P>Leibnizom, ktorý bol posadnutý myšlienkou univerzálnej charakterizácie 
      všetkých vied pomocou logiky, za&#269;ali snahy o&nbsp;formalizáciu logiky 
      samotnej pomocou matematických techník, &#269;o malo pre informatiku k&#318;ú&#269;ový 
      význam.</P>
      <P>Leibniz nielenže zostrojil kalkula&#269;ku, ale bol asi prvý, ktorý si jasne 
      uvedomil potrebu automatizácie výpo&#269;tov.</P>
      <P>Leibniz napísal: "<SPAN style="FONT-STYLE: italic">Astronómovia nebudú 
      musie&#357; preukazova&#357; trpezlivos&#357;, ktorá je potrebná pre výpo&#269;ty. Tieto 
      výpo&#269;ty ich odpútavajú od vytvárania a&nbsp;opráv tabuliek, od konštrukcie 
      astronomických almanachov, od práce s&nbsp;hypotézami a&nbsp;od vzájomných 
      diskusií pozorovaní. Je škoda, aby vynikajúci muži strácali hodiny, ako 
      otroci, na výpo&#269;toch, ktoré sa dajú zveri&#357; hocikomu, ak sa na výpo&#269;ty 
      použije stroj.</SPAN>"</P>
      <DIV class=img_divr><IMG title="Gottfried Wilhelm von Leibniz" 
      style="WIDTH: 220px; HEIGHT: 278px" alt="Gottfried Wilhelm von Leibniz" 
      src="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/gottfried_wilhelm_von_leibniz.jpg"><BR>Gottfried 
      Wilhelm von Leibniz <A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#zdroje">[10]</A></DIV>
      <P>V roku 1666 napísal Leibniz dielo "<A 
      href="http://en.wikipedia.org/wiki/De_Arte_Combinatoria" target=_blank>De 
      Arte Combinatoria</A>", ktoré charakterizoval ako "<SPAN 
      style="FONT-STYLE: italic">všeobecnú metódu, ktorou by sa všetka pravda 
      rozumu dala redukova&#357;, na istý druh výpo&#269;tov</SPAN>". Leibnizovou ideou, 
      dosia&#318; len málo realizovanou, bolo použi&#357;, stroje na testovanie hypotéz. 
      Môžeme teda poveda&#357;, že u Leibniza sú za&#269;iatky používania po&#269;íta&#269;ov na 
      dedukciu a&nbsp;v&nbsp;umelej inteligencii.</P>
      <P>Leibnizova kombinatorika zaujala samouka <A 
      href="http://en.wikipedia.org/wiki/George_Boole" target=_blank>Georga 
      Boolea</A> (1815&nbsp;–&nbsp;1864), o&nbsp;ktorom B.&nbsp;Russel napísal: 
      "<SPAN style="FONT-STYLE: italic">&#268;istá matematika bola objavená J. 
      Booleom v&nbsp;jeho práci publikovanej v&nbsp;roku 1854. Bola to práca: 
      'An investigations of the laws of thought, on which are founded the 
      mathematical theories of logik and probabilities'</SPAN>". Boole vo svojej 
      práci matematizoval logiku, formuloval axiómy a&nbsp;dal jej zákonom 
      algebrickú formu. Booleova algebra a&nbsp;funkcie sa neskôr stali hlavným 
      matematickým aparátom, ktorý umožnil logickú konštrukciu po&#269;íta&#269;ov.</P>
      <P>&#270;alší ve&#318;ký krok urobil <A 
      href="http://en.wikipedia.org/wiki/Gottlob_Frege" 
      target=_blank>F.&nbsp;L.&nbsp;G.&nbsp;Frege</A> (1848&nbsp;–&nbsp;1925), 
      matematik a&nbsp;filozof v&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Jena" target=_blank>Jene</A>, ktorý 
      vybudoval predikátový po&#269;et, &#269;ím položil základy formalizácie matematiky, 
      ako deduktívnej teórie, v&nbsp;ktorej sa z&nbsp;formálnych axióm 
      a&nbsp;pravidiel odvodzovania dajú mechanicky odvodzova&#357; pravdivé 
      tvrdenia. Na predikátovom po&#269;te dnes stojí moderná matematika, informatika 
      aj umelá inteligencia. Historický vznik predikátového po&#269;tu viedol 
      prirodzeným spôsobom&nbsp;k&nbsp;formulácii problému, ktorý mal pre 
      informatiku a&nbsp;umelú inteligenciu k&#318;ú&#269;ový význam: existujú algoritmy 
      schopné rozhodnú&#357;, pravdivos&#357; (matematických) tvrdení?</P>
      <P>V procese formalizácie matematiky zapo&#269;atom Frége pokra&#269;oval <A 
      href="http://en.wikipedia.org/wiki/Giuseppe_Peano" 
      target=_blank>G.&nbsp;Peano</A>, &#271;alej <A 
      href="http://en.wikipedia.org/wiki/Alfred_North_Whitehead" 
      target=_blank>A.&nbsp;N.&nbsp;Whitehead</A> a <A 
      href="http://en.wikipedia.org/wiki/Bertrand_Russell" 
      target=_blank>B.&nbsp;Russel</A> a&nbsp;vyústil v&nbsp;ambicióznom 
      programe, ktorý v&nbsp;r.&nbsp;1926 vytý&#269;il Hilbert a&nbsp;cie&#318;om ktorého 
      bolo vybudovanie celej klasickej matematiky ako formálnej teórie.</P>
      <P>Formálnu definíciu sémantiky predikátového po&#269;tu rozpracoval&nbsp;<A 
      href="http://en.wikipedia.org/wiki/Alfred_Tarski" target=_blank>Alfréd 
      Tarski</A> (1902&nbsp;–&nbsp;1983), ktorý za&#269;al rozlišova&#357; medzi jazykom 
      a&nbsp;metajazykom, &#269;o mu umožnilo oddeli&#357; syntax a&nbsp;sémantiku 
      a&nbsp;formalizova&#357; pojem pravdivosti. Položil základy teórie modelov, na 
      ktorej dnes stojí sémantika programovacích jazykov, teória abstraktných 
      typov dát a&nbsp;báz dát at&#271;.</P>
      <P><A href="http://en.wikipedia.org/wiki/David_Hilbert" 
      target=_blank>David Hilbert</A> (1862&nbsp;–&nbsp;1943), matematik 
      a&nbsp;matematický fyzik na <A 
      href="http://en.wikipedia.org/wiki/Georg-August_University_of_Göttingen" 
      target=_blank>univerzite v&nbsp;Göttingene</A>, je jednou 
      z&nbsp;najvä&#269;ších postáv modernej matematiky. Vo svojej dobe mal unikátne 
      postavenie a&nbsp;fakticky ur&#269;oval štýl a&nbsp;smer v&nbsp;matematike 
      a&nbsp;teoretickej fyzike na celom svete. K jeho žiakom patrili 
      K.&nbsp;Gödel, J.&nbsp;von&nbsp;Neumann, <A 
      href="http://en.wikipedia.org/wiki/Werner_Heisenberg" 
      target=_blank>W.&nbsp;Heisenberg</A>, R.&nbsp;Oppenheimer a&nbsp;celý rad 
      &#271;alších.</P>
      <P>Hilbertovým cie&#318;om bolo zachráni&#357; a&nbsp;z&nbsp;integrova&#357; klasickú 
      matematiku. Ukázalo sa že <A 
      href="http://en.wikipedia.org/wiki/Georg_Cantor" 
      target=_blank>Cantorova</A> <A 
      href="http://en.wikipedia.org/wiki/Set_theory" target=_blank>teória 
      množín</A> vedie k paradoxom. Riešenie, navrhované <A 
      href="http://en.wikipedia.org/wiki/Luitzen_Egbertus_Jan_Brouwer" 
      target=_blank>L.&nbsp;E.&nbsp;J.&nbsp;Browerom</A> a&nbsp;jeho školou, 
      tzv. <A href="http://en.wikipedia.org/wiki/Intuitionism" 
      target=_blank>intuicionistami</A>, spo&#269;ívalo v&nbsp;tom, že odmietali 
      považova&#357; tvrdenie za pravdivé alebo nepravdivé pokia&#318; nie je daná metóda 
      (algoritmus), ktorá to rozhodne a&nbsp;odmietali zákon vylú&#269;enia tretieho. 
      Intuicionizmus síce viedol&nbsp;k&nbsp;vylú&#269;eniu paradoxov, ale robil 
      ve&#318;kú &#269;as&#357; matematiky, hlavne analýzy, ktorá bola dovtedy "bez 
      protire&#269;ení" bu&#271; neplatnou alebo &#357;ažkopádnou. Hilbert, ako teoretický 
      fyzik intuicionizmus rozhodne odmietol a&nbsp;ako logik sa pokúsil už 
      spomínaným programom, t. j. v&nbsp;podstate na báze intuicionizmu (!), 
      ukáza&#357; bezospornos&#357; klasickej matematiky.</P>
      <P><A href="http://en.wikipedia.org/wiki/Kurt_Gödel" target=_blank>Kurt 
      Gödel</A> (1906&nbsp;–&nbsp;1978), v&nbsp;roku 1930 dokázal, pri použití 
      šikovného kódovania formúl &#269;íslami, že každý konzistentný formálny systém 
      obsahujúci Peanovu aritmetiku je neúplný (von Neumann sa pokúšal dokáza&#357; 
      opak). Tento výsledok, dnes známy ako Gödlelova veta, znamenal 
      v&nbsp;podstate, že Hilbertov plán je nereálny. Gödelov výsledok sú&#269;asne 
      ukazuje na ohrani&#269;ené možnosti formalizácie matematiky (a tým aj poznania 
      vôbec) &#269;ím sú dané ohrani&#269;enia aj pre umelú inteligenciu.</P>
      <P>&#270;alším Hilbertovým cie&#318;om bolo nájs&#357;, rozhodovací algoritmus pre 
      elementárnu teóriu &#269;ísiel. Skuto&#269;nos&#357;, že sa taký algoritmus nedarilo 
      zostroji&#357;, viedla&nbsp;k&nbsp;prirodzenej hypotéze, že neexistuje. Dokáza&#357; 
      neexistenciu algoritmu si však vyžadovalo formalizova&#357; do tej doby 
      intuitívny pojem algoritmu. V&nbsp;roku 1936 <A 
      href="http://en.wikipedia.org/wiki/Alonzo_Church" 
      target=_blank>A.&nbsp;Church</A>, <A 
      href="http://en.wikipedia.org/wiki/Stephen_Cole_Kleene" 
      target=_blank>S.&nbsp;C.&nbsp;Kleene</A>, <A 
      href="http://en.wikipedia.org/wiki/Emil_Leon_Post" 
      target=_blank>E.&nbsp;L.&nbsp;Post</A> a&nbsp;A.&nbsp;Turing vytvorili, 
      nezávisle rôzne formálne definície vypo&#269;ítate&#318;nej funkcie, ktoré sa 
      ukázali by&#357; ekvivalentné. To viedlo k&nbsp;formulovaniu tzv. Churchovej 
      tézy, že ak nejaká funkcia je vypo&#269;ítate&#318;ná, potom je vypo&#269;ítate&#318;ná 
      algoritmom v&nbsp;zmysle Churcha, Kleeneho, Posta aj Turinga.</P>
      <P>Kleeneho a&nbsp;Churchove spresnenie pojmu algoritmu bolo založené na 
      ideách logiky. Algoritmicky vypo&#269;ítate&#318;né funkcie definovali ako funkcie, 
      ktoré sa dajú vytvori&#357; z&nbsp;daného malého po&#269;tu jednoduchých funkcií 
      jednoduchými operáciami. Tým vznikla teória rekurzívnych funkcií, ktorá sa 
      stala základom teórie vy&#269;íslite&#318;nosti.</P>
      <P>Netradi&#269;né, na báze automatov, bolo Postove a&nbsp;Turingove spresnenie 
      algoritmu.</P>
      <P><A href="http://en.wikipedia.org/wiki/Alan_Turing" target=_blank>Alan 
      Mathison Turing</A> (1912&nbsp;–&nbsp;1954) v&nbsp;práci "<SPAN 
      style="FONT-STYLE: italic">On computable numbers with an application to 
      the </SPAN><A style="FONT-STYLE: italic" 
      href="http://en.wikipedia.org/wiki/Entscheidungsproblem" 
      target=_blank>Entschiedungsproblem</A>", ktorá sa &#269;asto považuje za 
      najvýznamnejšiu v&nbsp;teoretickej informatike, definoval automat, dnes 
      známy ako <A href="http://en.wikipedia.org/wiki/Turing_machine" 
      target=_blank>Turingov stroj</A>. Dá sa dokáza&#357;, že funkcia je 
      vypo&#269;ítate&#318;ná v&nbsp;zmysle Churcha alebo Kleeneho práve vtedy, ak je 
      vypo&#269;ítate&#318;ná na Turingovom stroji. Turing dokázal, modifikujúc dôkaz 
      Gödelovej vety, že pre tzv. problém zastavenia pre Turingov stroj 
      neexistuje algoritmus (a tým dokázal existenciu nerozhodnute&#318;ných 
      problémov), z&nbsp;&#269;oho už &#318;ahko vyplynulo, že &#271;alší Hilbertov cie&#318;, nájs&#357; 
      rozhodovaciu procedúru pre elementárnu teóriu &#269;ísiel, je nereálny. Turing 
      &#271;alej dokázal, pri použití vhodného kódovania Turingových strojov, 
      existenciu univerzálneho Turingovho stroja a&nbsp;tým ukázal, že 
      v&nbsp;princípe je možné zostroji&#357;, univerzálny po&#269;íta&#269;. Ukázal tiež, že 
      množina splnite&#318;ných booleovských formúl je úplná v&nbsp;rámci rekurzívne 
      spo&#269;etných množín (vzh&#318;adom na tzv. Turingovu redukovate&#318;nos&#357;), &#269;o viedlo 
      <A href="http://en.wikipedia.org/wiki/Stephen_Cook" 
      target=_blank>S.&nbsp;A.&nbsp;Cooka</A> 
      v&nbsp;r.&nbsp;1970&nbsp;k&nbsp;dôkazu existencie <A 
      href="http://en.wikipedia.org/wiki/NP-complete" target=_blank>NP–úplných 
      problémov</A>. Turingove výsledky boli základom teórie automatov 
      s&nbsp;neohrani&#269;enou pamä&#357;ou.</P>
      <P>Turing bol ve&#318;kou postavou aj v&nbsp;umelej inteligencii. 
      Diskusie&nbsp;o&nbsp;možnostiach a&nbsp;ohrani&#269;eniach strojov za&#269;ali už 
      po&#269;as jeho pobytu v&nbsp;Bletchley. Zvláš&#357; ho zaujala idea po&#269;íta&#269;ov 
      hrajúcich šach, GO at&#271;. Preslávil sa však hlavne prácou "<SPAN 
      style="FONT-STYLE: italic">Can a&nbsp;machine think?</SPAN>" a&nbsp;testom 
      pre ur&#269;ovanie inteligentného chovanca. Jeho koniec bol smutný. Ako 
      homosexuál sa dostal do rozporu s&nbsp;vtedajšími zákonmi 
      a&nbsp;v&nbsp;depresii sa&nbsp; otrávil.</P>
      <P>Na po&#269;es&#357; A. M. Turinga ude&#318;uje americká spolo&#269;nos&#357; <A 
      href="http://en.wikipedia.org/wiki/Association_for_Computing_Machinery" 
      target=_blank>Association for Computing Machinery</A> každoro&#269;ne, od roku 
      1966, tzv. <A href="http://en.wikipedia.org/wiki/Turing_Award" 
      target=_blank>Turingovu cenu</A> významným osobnostiam, ktoré svojou 
      odbornou prácou vytvorili príspevok ve&#318;kej a&nbsp;trvalej hodnoty 
      v&nbsp;oblasti informatiky a&nbsp;umelej inteligencie. P<SPAN 
      style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'">Scheutzov stroj <A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/dej_inf/Dejiny_inf.html#zdroje">[6]</A></SPAN>re 
      zaujímavos&#357; uve&#271;me mená všetkých nosite&#318;ov týchto cien, 
      v&nbsp;chronologickom poradí, v&nbsp;ktorom ceny obd&#341;žali, po&#269;núc rokom 
      1966 až po rok 1982: A.&nbsp;J.&nbsp;Perils, M.&nbsp;W.&nbsp;Wilkes, 
      R.&nbsp;W.&nbsp;Haming, M.&nbsp;Minsky, J.&nbsp;H.&nbsp;Wilkinson, 
      J.&nbsp;McCarthy, E.&nbsp;W.&nbsp;Dijkstra, C.&nbsp;W.&nbsp;Bachman, 
      D.&nbsp;E.&nbsp;Knuth, A.&nbsp;Newell a&nbsp;H.&nbsp;A.&nbsp;Simon, 
      M.&nbsp;O.&nbsp;Rabin a&nbsp;D.&nbsp;Scott, J.&nbsp;Bakus, 
      R.&nbsp;W.&nbsp;Floyd, K.&nbsp;E.&nbsp;Iverson, 
      C.&nbsp;A.&nbsp;R.&nbsp;Hoare, E.&nbsp;F.&nbsp;Codd, S.&nbsp;A.&nbsp;Cook. 
      Každé z&nbsp;týchto mien je späté s &#269;as&#357;ou modernej histórie informatiky 
      alebo umelej inteligencie.</P>
      <P>Teória kone&#269;ných automatov vzišla z&nbsp;práce W. S. McCullocha 
      s&nbsp;V.&nbsp;Pittsa "<SPAN style="FONT-STYLE: italic">A&nbsp;logical 
      calculus of the ideas immanent in nervous activity</SPAN>" 
      z&nbsp;r.&nbsp;1943 o&nbsp;vz&#357;ahu algebry a&nbsp;neurónových sietí. Je 
      zaujímavé, že von Neumann hodnotil ich výsledky ako "<SPAN 
      style="FONT-STYLE: italic">probably the most significant result obtained 
      with axiomatic method up to now</SPAN>", ktorý ukazuje, že "<SPAN 
      style="FONT-STYLE: italic">any functioning which can be defined at all 
      logically, strictly and unambiguously in a&nbsp;finite number of words can 
      also be realised by such a&nbsp;formal neural network</SPAN>". Týmito 
      slovami dnes obvykle charakterizujeme Turingov výsledok, ktorý von Neumann 
      poznal. Znamená to, že ani takému géniovi, akým bol von Neumann, nebol 
      vtedy dostato&#269;ne jasný rozdiel medzi tým, &#269;o dnes nazývame kone&#269;ným 
      a&nbsp;nekone&#269;ným automatom.</P>
      <P>Do teórie automatov významne zasiahol v&nbsp;dvoch smeroch aj von 
      Neumann. Vychádzajúc z&nbsp;prác McCullocha a&nbsp;Pittsa rozpracoval 
      teóriu spo&#318;ahlivých automatov, zložených z&nbsp;nespo&#318;ahlivých elementov. 
      Táto teória, motivovaná potrebami raketového priemyslu, upadla na &#269;as do 
      zabudnutia a&nbsp;oprášila sa až pri prácach o&nbsp;"fault–tolerant 
      computers".</P>
      <P>Jedným z&nbsp;tých, ktorí pokra&#269;ovali v&nbsp;teórii spo&#318;ahlivých 
      automatov, bol &#271;alší velikán <A 
      href="http://en.wikipedia.org/wiki/Claude_Elwood_Shannon" 
      target=_blank>C.&nbsp;E.&nbsp;Shannon</A> (1916 – 2001). Už vo svojich 
      "<SPAN style="FONT-STYLE: italic">master's thesis</SPAN>" majstrovsky 
      ukázal (&#269;o je možno najvýznamnejšia diplomovka v&nbsp;informatike), ako 
      použi&#357; Booleovu algebru na analýzu logických obvodov. Neskoršie (1949) 
      položil základy teórie informácie a&nbsp;stal sa tak priekopníkom modernej 
      teórie prenosu informácie.</P>
      <P>V súvislosti s&nbsp;úvahami&nbsp;o&nbsp;možnostiach 
      a&nbsp;ohrani&#269;eniach strojov sa von Neumann za&#269;al v&nbsp;r.&nbsp;1947 
      zaobera&#357; otázkou, &#269;i existujú samoreprodukujúce sa automaty. Tak vznikla 
      biologicky motivovaná teória celulárnych automatov, v&nbsp;ktorej dal 
      pozitívnu odpove&#271; na túto netriviálnu otázku a&nbsp;ktorá sa stala 
      základom teórie paralelných automatov, systolických systémov 
      a&nbsp;moderných paralelných po&#269;íta&#269;ov.</P>
      <P>Teória automatov bola posledným ve&#318;kým záujmom von Neunanna, 
      v&nbsp;ktorom sa spojili jeho záujmy o&nbsp;logiku, neurofyziológiu 
      a&nbsp;po&#269;íta&#269;e. Pripisoval jej ve&#318;ký význam. Pracoval na nej sám, &#269;o bolo 
      u neho neobvyklé, mala sa asi sta&#357; jeho monumentom. Ako teoretického 
      fyzika, ktorý poznal silu matematickej analýzy, ho však neuspokojovala 
      "diskrétnos&#357;" automatov. Plánoval rozpracova&#357; teóriu spojitých automatov, 
      v&nbsp;ktorej o&#269;akával, že "<SPAN style="FONT-STYLE: italic">a system of 
      non–linear partial differenetial equations will be used</SPAN>". 
      (V&nbsp;roku 1963 Nobelovu cenu za medicínu získali <A 
      href="http://en.wikipedia.org/wiki/Alan_Lloyd_Hodgkin" target=_blank>A. L. 
      Hodgkin</A> a&nbsp;<A href="http://en.wikipedia.org/wiki/Andrew_Huxley" 
      target=_blank>A.&nbsp;F. Huxley</A>, ktorí opísali chovanie nervových 
      vlákien nelineárnymi parciálnymi diferenciálnymi rovnicami).</P>
      <P>Je otázne, &#269;o by sa bolo stalo, keby von Neumann bol poznal dnešné 
      výsledky, týkajúce sa DNA a&nbsp;molekulárnej biológie. Kde by boli dnes 
      biopo&#269;íta&#269;e?</P>
      <DIV style="TEXT-ALIGN: right"><A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#start">spa&#357; 
      na obsah</A></DIV>
      <H2><A name=3></A>3 VÝPO&#268;TOVÁ TECHNIKA NA PRAHU PO&#268;ÍTA&#268;OVEJ REVOLÚCIE</H2>
      <DIV style="TEXT-ALIGN: right"><SPAN style="FONT-STYLE: italic">Get what 
      you can and what you get hold</SPAN><BR style="FONT-STYLE: italic"><SPAN 
      style="FONT-STYLE: italic">this is the stone that will turn your lead into 
      gold.</SPAN><BR style="FONT-STYLE: italic"><A 
      href="http://en.wikipedia.org/wiki/Benjamin_Franklin" target=_blank><SPAN 
      style="FONT-STYLE: italic">B. Franklin</SPAN></A><BR></DIV><BR>
      <P>Úvodom nieko&#318;ko &#269;íselných údajov. Rýchlos&#357; výpo&#269;tu pomocou prostriedkov 
      výpo&#269;tovej techniky sa za posledných 30 rokov zvýšila 10<SUP>5</SUP>–krát, 
      zatia&#318; &#269;o po&#269;as predchádzajúcich 2500 rokov iba 10–krát. Naproti tomu cena 
      vykonania jednej inštrukcie sú&#269;asne klesla z&nbsp;nieko&#318;kých dolárov na 
      10<SUP>-6</SUP>&nbsp;centov. Rozmery <A 
      href="http://en.wikipedia.org/wiki/Central_processing_unit" 
      target=_blank>centrálnej jednotky po&#269;íta&#269;a</A> (CPU), o&nbsp;výkone 
      porovnate&#318;nom s&nbsp;po&#269;íta&#269;om pred 25–timi rokmi sa zmenšili taktiež 
      miliónkrát, spo&#318;ahlivos&#357; CPU však vzrástla 120–krát. Ak by sa letecký 
      priemysel vyvíjal obdobným spôsobom, potom by sú&#269;asná cena lietadla <A 
      href="http://en.wikipedia.org/wiki/Boeing_767" target=_blank>Boeing 
      767</A> bola 500&nbsp;dolárov, lietadlo by obletelo zemegu&#318;u za 
      25&nbsp;sekúnd a&nbsp;spotrebovalo by 5&nbsp;litrov paliva.</P>
      <DIV class=img_divl><A 
      href="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/moore_law_diagram.png"><IMG 
      title="Moorov zákon" style="WIDTH: 260px; HEIGHT: 223px" 
      alt="Moorov zákon" 
      src="Dejiny informatiky - Po&#269;íta&#269;ová revolúcia.files/moore_law_diagram.png"></A><BR>Moorov 
      zákon <A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#zdroje">[11]</A><BR><SMALL 
      style="COLOR: rgb(128,128,128)">po kliknutí sa obrázok zobrazí v plnom 
      rozlíšení</SMALL></DIV>
      <P>Ni&#269; zatia&#318; nenasved&#269;uje tomu, že by sa doterajšie tempo rozvoja 
      znížilo. Cena logických obvodov po&#269;íta&#269;ov klesá vo svetovom 
      merítku&nbsp;o&nbsp;25% ro&#269;ne, cena pamä&#357;ových obvodov dokonca 
      o&nbsp;40%&nbsp;a&nbsp;to navzdory existujúcej inflácii. Zatia&#318; &#269;o 
      v&nbsp;r.&nbsp;1975 bola odhadovaná rýchlos&#357; po&#269;íta&#269;a pre hromadné 
      spracovanie údajov v&nbsp;roku 2000&nbsp;na 41.7&nbsp;miliónov inštrukcií 
      za sekundu (MIPS), už teraz existujú laboratórne vzorky procesorov 
      s&nbsp;rýchlos&#357;ou 3 – 5 BIPS (10<SUP>9</SUP>&nbsp;inštrukcií za sekundu) 
      a&nbsp;známy projekt 5. generácie z&nbsp;Japonska predpokladá v&nbsp;90. 
      rokoch špi&#269;kový výkon po&#269;íta&#269;ov až 1000 BIPS .</P>
      <DIV style="TEXT-ALIGN: right"><A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#start">spa&#357; 
      na obsah</A></DIV>
      <H3><A name=3_1></A>3.1 POLOVODI&#268;E&nbsp;–&nbsp;ZÁKLAD PO&#268;ÍTA&#268;OVÉHO 
      BLAHOBYTU</H3>
      <P>Výrobky výpo&#269;tovej techniky sú v&nbsp;absolútnej vä&#269;šine zložené 
      z&nbsp;polovodi&#269;ových mikroelektronických sú&#269;iastok. Preto neprekvapuje, 
      že práve búrlivý rozvoj technológie <A 
      href="http://en.wikipedia.org/wiki/Semiconductor" 
      target=_blank>polovodi&#269;ov</A> v posledných 30–tich rokoch je základom 
      úspešného uplatnenia a&nbsp;rozšírenia výpo&#269;tovej techniky. Okamžite ako 
      bolo zistené, že pomocou tranzistorov je možné realizova&#357; logické 
      funkcie&nbsp;i&nbsp;pamä&#357;ové prvky, vývoj výpo&#269;tovej techniky sledoval 
      v&nbsp;tesnom závese prudký vývoj polovodi&#269;ovej technológie.</P>
      <P>Za za&#269;iatok polovodi&#269;ovej revolúcie sa považuje objav <A 
      href="http://en.wikipedia.org/wiki/Transistor" 
      target=_blank>tranzistoru</A> v&nbsp;r.&nbsp;1947 pracovníkmi <A 
      href="http://en.wikipedia.org/wiki/Bell_Labs" target=_blank>Bell Telephone 
      Laboratories</A>.</P>
      <P>Význam tohto objavu ocenil výstižne P. Haggerty v&nbsp;r.&nbsp;1977: 
      "<SPAN style="FONT-STYLE: italic">Som presved&#269;ený, že </SPAN><A 
      style="FONT-STYLE: italic" 
      href="http://en.wikipedia.org/wiki/John_Bardeen" target=_blank>John 
      Bardeen</A><SPAN style="FONT-STYLE: italic">, </SPAN><A 
      style="FONT-STYLE: italic" 
      href="http://en.wikipedia.org/wiki/Walter_Brattain" target=_blank>Walter 
      Brattain</A><SPAN style="FONT-STYLE: italic"> a&nbsp;</SPAN><A 
      style="FONT-STYLE: italic" 
      href="http://en.wikipedia.org/wiki/William_Shockley" target=_blank>William 
      Schockley</A><SPAN style="FONT-STYLE: italic"> objavením tranzistoru 
      neoddiskutovate&#318;ne prispeli k prospechu &#318;udstva. Ich príspevok 
      s&nbsp;dlhotrvajúcim pôsobením bude ma&#357; vä&#269;ší význam pre &#318;udstvo než 
      Gutenbergov objav tla&#269;e. Verím, že ich práca za&#269;ala revolúciu ove&#318;a 
      vzrušujúcejšiu a&nbsp;produktívnejšiu vo svojich dôsledkoch pre budúcnos&#357; 
      &#318;udstva, ako bola prvá priemyselná revolúcia za&#269;atá objavom </SPAN><A 
      style="FONT-STYLE: italic" href="http://en.wikipedia.org/wiki/James_Watt" 
      target=_blank>Wattovho</A> <A style="FONT-STYLE: italic" 
      href="http://en.wikipedia.org/wiki/Watt_steam_engine" 
      target=_blank>parného stroja</A>". (Toto ocenenie vychádzalo už 
      z&nbsp;&#271;alšieho vývoja polovodi&#269;ovej technológie.)</P>
      <P>Tranzistor bol zavedený do výroby na za&#269;iatku 50–tých rokov. Ešte celé 
      &#271;alšie desa&#357;ro&#269;ie ovládali trh diskrétne polovodi&#269;ové sú&#269;iastky (1 
      sú&#269;iastka = 1 tranzistor). Až koncom 50–tých rokov došlo ku trom významným 
      objavom, ktoré dali základ dnešným zložitým polovodi&#269;ovým prvkom. 
      V&nbsp;r.&nbsp;1959 bol zav<SPAN 
      style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'">Scheutzov stroj <A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/dej_inf/Dejiny_inf.html#zdroje">[6]</A></SPAN>edený 
      <A href="http://en.wikipedia.org/wiki/Integrated_circuit" 
      target=_blank>integrovaný obvod</A> (IO) – postup, ktorý umož&#328;oval vyrobi&#357; 
      v&nbsp;polovodi&#269;i v&nbsp;rámci jediného výrobného procesu všetky aktívne i 
      pasívne prvky požadované k zostaveniu rôznych obvodov. &#270;alším významným 
      prínosom sa stal planárny proces, zavedený firmou <A 
      href="http://en.wikipedia.org/wiki/Fairchild_Semiconductor" 
      target=_blank>Fairchild Semiconductor</A> v&nbsp;r.&nbsp;1961. Umož&#328;oval 
      plošné vytváranie polovodi&#269;ového <A 
      href="http://en.wikipedia.org/wiki/P-n_junction" target=_blank>P–N 
      prechodu</A> a&nbsp;tým sú&#269;asnú výrobu viac tranzistorov na jednej plochej 
      podložke – &#269;ipe. Uplatnenie planárneho procesu na integrovaný obvod 
      (vrátane vytvárania spojov medzi tranzistormi) bolo tretím objavom, ktorý 
      viedol k praktickému uplatnení integrovaných obvodov (IO).</P>
      <P>Integrované obvody 60–tých rokov boli obvody malej integrácie (SSI – 
      small scale integration) – do 10 hradiel v&nbsp;puzdre a&nbsp;neskôr 
      strednej integrácie (MSI) – 10<SUP>1</SUP> až 10<SUP>2</SUP> hradiel 
      v&nbsp;jednom puzdre. Typickým príkladom IO strednej integrácie sú 
      4–bitové &#269;íta&#269;e, akumulátory, posuvne registre atd.</P>
      <P>Zatia&#318; &#269;o 60–te roky boli obdobím obvodov v&nbsp;jednom puzdre, 
      charakteristickým rysom obdobia 1970&nbsp;–&nbsp;1980 je zavedenie výroby 
      celého systému v&nbsp;jednom puzdre. Tieto IO sú ozna&#269;ované ako obvody 
      ve&#318;kej integrácie (LSI – large scale integration) a&nbsp;po&#269;et hradiel sa 
      pohybuje v&nbsp;rozmedzí 10<SUP>3</SUP>&nbsp; až 10<SUP>4</SUP> 
      v&nbsp;jednom puzdre. Zvýšenú hustotu sú&#269;iastok v&nbsp;IO umožnilo hlavne 
      zavedenie tzv. <A href="http://en.wikipedia.org/wiki/MOSFET" 
      target=_blank>MOS tranzistorov</A>, ktoré zaberali menšiu plochu na &#269;ipe, 
      i &#271;alšie zlepšenia jednotlivých krokov v&nbsp;celom procese výroby IO.</P>
      <DIV style="TEXT-ALIGN: right"><A 
      href="http://edi.fmph.uniba.sk/~winczer/historia/GHWZ/index.html#start">spa&#357; 
      na obsah</A></DIV><BR><BR>
      <TABLE style="WIDTH: 100%; TEXT-ALIGN: left" cellSpacing=2 cellPadding=2 
      border=0>
        <TBODY>
        <TR>
          <TD><A name=vss></A>*</TD>
          <TD>VVS, Dúbravská 3, 84 2 21 Bratislava</TD></TR>
        <TR>
          <TD><A name=meta></A>**</TD>
          <TD>META, v. p. SI, Sázavská 11, 120 00 Praha</TD></TR>
        <TR>
          <TD><A name=vums></A>***</TD>
          <TD>VÚMS, k. ú. o., Lužná 2, 160 00 Praha<BR></TD></TR>
        <TR>
          <TD></TD>
          <TD></TD></TR>
        <TR>
          <TD></TD>
          <TD></TD></TR>
        <TR>
          <TD></TD>
          <TD></TD></TR></TBODY></TABLE><BR>
      <TABLE style="WIDTH: 100%; TEXT-ALIGN: left" cellSpacing=2 cellPadding=2 
      border=0>
        <TBODY>
        <TR>
          <TD style="VERTICAL-ALIGN: top" colSpan=2><A name=zdroje></A><SPAN 
            style="FONT-WEIGHT: bold">Použité zdroje:</SPAN></TD></TR>
        <TR>
          <TD style="VERTICAL-ALIGN: top"><SMALL>[1]</SMALL><BR></TD>
          <TD style="VERTICAL-ALIGN: top"><SMALL>J. Gruska, I. M. Havel, J. 
            Wiedermann, J. Zelený, "<SPAN style="FONT-STYLE: italic">Po&#269;íta&#269;ová 
            revolúcia.</SPAN>"<BR>In: SOFSEM'82, 1982, pp. 7-64 </SMALL></TD></TR>
        <TR>
          <TD style="VERTICAL-ALIGN: top"><SMALL>[2]</SMALL><BR></TD>
          <TD 
            style="VERTICAL-ALIGN: top"><SMALL>http://en.wikipedia.org/wiki/Image:Gutenberg.jpg<BR>http://upload.wikimedia.org/wikipedia/commons/3/33/Gutenberg.jpg<BR>(18. 
            01. 2007)</SMALL><BR></TD></TR>
        <TR>
          <TD style="VERTICAL-ALIGN: top"><SMALL>[3]</SMALL></TD>
          <TD 
            style="VERTICAL-ALIGN: top"><SMALL>http://en.wikipedia.org/wiki/Image:Jacquard.loom.hooks.jpg<BR>http://upload.wikimedia.org/wikipedia/commons/8/8e/Jacquard.loom.hooks.jpg<BR>(18. 
            01. 2007)</SMALL></TD></TR>
        <TR>
          <TD style="VERTICAL-ALIGN: top"><SMALL>[4]</SMALL></TD>
          <TD 
            style="VERTICAL-ALIGN: top"><SMALL>http://www.thocp.net/timeline/timeline.htm<BR>http://www.thocp.net/hardware/pictures/calculators/schickard_calculator_b.gif<BR>(18. 
            01. 2007)</SMALL></TD></TR>
        <TR>
          <TD style="VERTICAL-ALIGN: top"><SMALL>[5]</SMALL></TD>
          <TD 
            style="VERTICAL-ALIGN: top"><SMALL>http://en.wikipedia.org/wiki/Image:Arts_et_Metiers_Pascaline_dsc03869.jpg<BR>http://upload.wikimedia.org/wikipedia/commons/8/80/Arts_et_Metiers_Pascaline_dsc03869.jpg<BR>(18. 
            01. 2007)</SMALL></TD></TR>
        <TR>
          <TD style="VERTICAL-ALIGN: top"><SMALL>[6]</SMALL></TD>
          <TD 
            style="VERTICAL-ALIGN: top"><SMALL>http://www.lahosken.san-francisco.ca.us/departures/wash_dc/1/01_scheutz.html<BR>http://www.lahosken.san-francisco.ca.us/departures/wash_dc/1/01_scheutz.jpg<BR>(18. 
            01. 2007)</SMALL></TD></TR>
        <TR>
          <TD style="VERTICAL-ALIGN: top"><SMALL>[7]</SMALL></TD>
          <TD 
            style="VERTICAL-ALIGN: top"><SMALL>http://www.apogeevr.com/2005/08/21/reviews/<BR>http://www.apogeevr.com/wp-content/apogeevr_babbage_mill_computer_affair.jpg<BR>(18. 
            01. 2007)</SMALL></TD></TR>
        <TR>
          <TD style="VERTICAL-ALIGN: top"><SMALL>[8]</SMALL></TD>
          <TD 
            style="VERTICAL-ALIGN: top"><SMALL>http://en.wikipedia.org/wiki/Image:JohnvonNeumann-LosAlamos.jpg<BR>http://upload.wikimedia.org/wikipedia/commons/d/d6/JohnvonNeumann-LosAlamos.jpg<BR>(18. 
            01. 2007)</SMALL></TD></TR>
        <TR>
          <TD style="VERTICAL-ALIGN: top"><SMALL>[9]</SMALL></TD>
          <TD 
            style="VERTICAL-ALIGN: top"><SMALL>http://en.wikipedia.org/wiki/Image:Abu_Abdullah_Muhammad_bin_Musa_al-Khwarizmi.jpg<BR>http://upload.wikimedia.org/wikipedia/en/2/26/Abu_Abdullah_Muhammad_bin_Musa_al-Khwarizmi.jpg<BR>(18. 
            01. 2007)</SMALL></TD></TR>
        <TR>
          <TD style="VERTICAL-ALIGN: top"><SMALL>[10]</SMALL></TD>
          <TD 
            style="VERTICAL-ALIGN: top"><SMALL>http://en.wikipedia.org/wiki/Image:Gottfried_Wilhelm_von_Leibniz.jpg<BR>http://upload.wikimedia.org/wikipedia/commons/6/6a/Gottfried_Wilhelm_von_Leibniz.jpg<BR>(18. 
            01. 2007)</SMALL></TD></TR>
        <TR>
          <TD style="VERTICAL-ALIGN: top"><SMALL>[11]</SMALL></TD>
          <TD 
            style="VERTICAL-ALIGN: top"><SMALL>http://en.wikipedia.org/wiki/Image:Moore_Law_diagram_(2004).png<BR>http://upload.wikimedia.org/wikipedia/commons/0/06/Moore_Law_diagram_(2004).png<BR>(18. 
            01. 
      2007)</SMALL></TD></TR></TBODY></TABLE><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR>&nbsp;<BR>&nbsp;<BR>&nbsp;</TD></TR></TBODY></TABLE><BR></BODY></HTML>
